[{"description":"Street parking starting at the corner of 3rd street. and Parker continuing along 3rd street to Garland Ave.","index":0,"latitude":35.387385,"longitude":-94.429605,"name":"3rd Street Parking"},{"description":"The small parking area for the 49 Palms Oasis Trail. There is a vault toilet near the trailhead.","index":1,"latitude":34.11956789731899,"longitude":-116.11216793205926,"name":"49 Palms Oasis"},{"description":"ADA parking spaces available behind the Visitor Center next to reserved employee parking spaces.","index":2,"latitude":39.037983,"longitude":-95.676738,"name":"ADA Parking"},{"description":"The parking lot is centrally located near the boat launch, picnic pavilion, and restroom facilities. There are restrictions on where different types of vehicles may be parked so please pay attention to the signage.","index":3,"latitude":34.023899,"longitude":-84.171415,"name":"Abbotts Bridge Parking Lot"},{"description":"The Abbotts Lagoon Trailhead Parking Lot is a dirt/gravel parking lot that can accommodate ~40 vehicles. The Abbotts Lagoon Trailhead is at the northwest corner of the lot. A vault toilet building and litter and recycling receptacles are located along the east side of the lot. The Abbotts Lagoon Trailhead Parking Lot is approximately 25 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard and Pierce Point Road.","index":4,"latitude":38.12345298763027,"longitude":-122.93533422224954,"name":"Abbotts Lagoon Trailhead Parking Lot"},{"description":"This small lot consists entirely of accessible parking spaces and is designated for use by visitors with mobility concerns. It is located at the end of the main park access road, slightly uphill from the main parking lot and adjacent to the post trader store and park obelisk.","index":5,"latitude":42.204017,"longitude":-104.557753,"name":"Accessible Lot"},{"description":"Access to the park Administration building (no public access), the Joseph Plumb Martin trail, Redoubt 2, and Muhlenberg's Brigade.","index":6,"latitude":40.1007,"longitude":-75.422251,"name":"Administration Parking Lot"},{"description":"","index":7,"latitude":33.891571,"longitude":-84.444711,"name":"Akers Drive Parking Lot"},{"description":"","index":8,"latitude":34.00889,"longitude":-84.355065,"name":"Allenbrook Parking Lot"},{"description":"3 gravel Parking Lots across from the Old Anglers Inn Restaurant with restrooms and water fountain(warm months)","index":9,"latitude":38.98174,"longitude":-77.226387,"name":"Anglers"},{"description":"The Appomattox River Wayside Pull Off north of the river is an elevated gravel lot that provides access to wayside informational signs discussing the surrender of the Army of Northern Virginia's artillery and two Virginia state historical markers discussing the African American origins of the banjo and Joel Sweeney, the local banjo player.","index":10,"latitude":37.3814,"longitude":-78.7899,"name":"Appomattox River Wayside Pull Off North"},{"description":"The Appomattox River Wayside pull off south of the river is a flat, gravel pull off that provides access to a picnic area and small foot bridge over the Appomattox River. There is a Virginia State Marker that identifies Route 24 as a Blue Star Highway.","index":11,"latitude":37.3828,"longitude":-78.7894,"name":"Appomattox River Wayside Pull Off South"},{"description":"Access to Artillery Park (Stop 7 on the Encampment Tour route), Joseph Plumb Martin trail, the historic trace road, Mt. Joy trail, and Redoubt 3.","index":12,"latitude":40.094207,"longitude":-75.449076,"name":"Artillery Park Parking Lot"},{"description":"","index":13,"latitude":34.001879,"longitude":-84.365124,"name":"Azalia Drive Parking Lots"},{"description":"A small Parking lot at the Baker Creek Trailhead","index":14,"latitude":38.97683,"longitude":-114.24517,"name":"Baker Creek Trailhead Parking Lot"},{"description":"Bard Rock is open to pedestrians daily during the park's operating hours. Vehicle access is limited during times of high visitation or inclement weather for public safety. Typically, Bard Rock vehicle access is not available on weekends, holidays, and during winter.","index":15,"latitude":41.805297177531436,"longitude":-73.94413843308553,"name":"Bard Rock Vehicle Access and Parking Lot"},{"description":"The Barker Dam Parking Lot is a paved lot that provides access to the Barker Dam Trail and the Wall Street Mill Trail.","index":16,"latitude":34.024773,"longitude":-116.142199,"name":"Barker Dam Parking Lot"},{"description":"The level grass area allows more convenient walking access to the historic barn and ranch house. The designated parking spots are next to a shaded picnic area. Restrooms and water filling station are across from the barn.","index":17,"latitude":38.433645,"longitude":-96.558972,"name":"Barn Handicap Parking"},{"description":"Parking lot off of US 29 that is one of two access points to the Brawner Farm Loop Trail. Driving tour stop number two. Park in designated spaces. No equestrian trailer parking.","index":18,"latitude":38.81136019725697,"longitude":-77.55727124218897,"name":"Battery Heights Parking Lot"},{"description":"The overlook parking lot offers closer access to the battlefield.","index":19,"latitude":26.02002,"longitude":-97.476547,"name":"Battlefield Overlook Parking Lot"},{"description":"The Bayview Trailhead Parking Lot is a small dirt parking lot with space for ~20 vehicles on the north side of Limantour Road 4.4 miles (7 km) from Bear Valley Road. The Bayview Trail crosses Limantour Road at this location and the Inverness Ridge Trail heads north from the parking lot's western end. The Bayview Trailhead Parking Lot is approximately 12 minutes by car from the Bear Valley Visitor Center. A bulletin board with information about the 1995 Vision Fire is located along the lot's north side.","index":20,"latitude":38.059341752400655,"longitude":-122.8502869195155,"name":"Bayview Trailhead Parking Lot"},{"description":"This lot is located directly across the main entrance to the park visitor center. It allows access to the area beaches. This lot also includes a vehicle EXIT ONLY ramp from the St. Johns County beach driving access.","index":21,"latitude":29.716903,"longitude":-81.232792,"name":"Beach Ramp"},{"description":"A dirt parking lot near the Bear Valley Visitor Center and Bear Valley Trailhead with space for ~20 buses, RVs, and/or vehicles towing trailers. It is available for day use only. The Bear Valley Trailhead is at the southeast corner of the lot.","index":22,"latitude":38.0401859377134,"longitude":-122.799989302849,"name":"Bear Valley Bus/RV/Trailer Parking Lot"},{"description":"A gravel parking lot with space for ~210 vehicles. The Bear Valley Trailhead is at the southwest corner of the parking lot. The Bear Valley Picnic Area is to the north of the parking lot and its restroom is at the parking lot's northeast corner. The Bear Valley Visitor Center is located a short distance to the northwest.","index":23,"latitude":38.040187937759,"longitude":-122.799376302758,"name":"Bear Valley Trailhead Parking Lot"},{"description":"A paved parking lot with space for 52 vehicles adjacent to the Bear Valley Visitor Center. As of June 2022, there are six type-2 EV charging stations available. To help reduce traffic congestion in the Bear Valley Visitor Center Parking Lot, please park your vehicle(s) in the gravel, trailhead/picnic area parking lot on the left (east) side of the access road close to the Bear Valley Trailhead if you will be parking your car in the area for more than 30 minutes.","index":24,"latitude":38.0413079378122,"longitude":-122.799866302964,"name":"Bear Valley Visitor Center Parking Lot"},{"description":"The Beaver Pond Trail parking lot is a small gravel lot along Alabama Highway 176 / Little River Canyon Rim Parkway. This parking lot also serves as access to utility lines - do not block the gate.","index":25,"latitude":34.230027,"longitude":85.374533,"name":"Beaver Pond Trailhead"},{"description":"Blue Hole is a family friendly swim holes at Little River Canyon National Preserve. The Blue Hole parking lot is found .25 miles east of the Little River Falls parking lot on Alabama Highway 35. The parking lot is dirt, gravel, and rock - parking is not allowed along the access road to the lot. Lot subject to flooding. This parking lot fills up quickly during the busy summer months, often being full by 11:00 AM. Once full, park staff may close the lot until spots become available - please plan accordingly.","index":26,"latitude":34.234208,"longitude":85.372053,"name":"Blue Hole"},{"description":"Space for parking at the Bolinas Ridge Trailhead consists of an approximately 300-foot-long paved shoulder and an approximately 200-foot-long gravel shoulder along the sides of Sir Francis Drake Boulevard 1.1 miles east of Olema. There are no other facilities or amenities at this location. This trailhead is approximately 5 minutes by car from the Bear Valley Visitor Center. Space is limited. Please make sure your vehicle is entirely out of the lane of travel.","index":27,"latitude":38.04620271595562,"longitude":-122.77082204818726,"name":"Bolinas Ridge Trailhead Roadside Parking"},{"description":"Parking lot off Whitman Avenue for the Bolivar Heights Trail. Access at the end of Whitman Avenue, Bolivar, WV 25425. Park in designated spaces only.","index":28,"latitude":39.32377307220277,"longitude":-77.76119425222025,"name":"Bolivar Heights Parking Area"},{"description":"This is a large lot that provides access to the Boston Mill Visitor Center. The lot is paved and visitors follow paved pathways to the visitor center. The lot has 106 spaces including 6 accessible, 1 carpool, 2 limited mobility, and 6 fuel efficient vehicle spaces. Six oversized vehicle spaces are located across the street from the main Boston Mill Visitor Center parking area. This lot also contains 9 additional vehicle spaces, 1 fuel efficient vehicle space, and 1 accessible vehicle space.","index":29,"latitude":41.26258333333333,"longitude":-81.5603611111111,"name":"Boston Mill Visitor Center Main Lot"},{"description":"The gravel parking lot is off county road 227. The lot has a single entrance with fence line. Larger vehicles will be difficult to maneuver in a full lot. Two unisex restrooms, a bike rack, and picnic tables are provided at the parking area. The dog-friendly Bottomland Nature Trail connects with the trail network for short or extensive hiking.","index":30,"latitude":38.402412,"longitude":-96.55157,"name":"Bottomland Nature Trail Parking"},{"description":"This parking lot is located just inside the park along the road leading to the U.S. Army Corps of Engineers Lower Pool West Parking Lot. The parking lot is not paved and therefore parking capacity is dictated by how close together vehicles are parked.","index":31,"latitude":34.15666,"longitude":-84.07992,"name":"Bowmans Island Parking Lot"},{"description":"","index":32,"latitude":39.8323,"longitude":-79.6004,"name":"Braddock Grave Parking"},{"description":"A midsized paved parking area that provides access to Brandywine Falls (via boardwalk) and the Summit Metroparks Hike and Bike trail.","index":33,"latitude":41.276347,"longitude":-81.53929,"name":"Brandywine Falls"},{"description":"Parking lot off of Pageland Lane with seasonal bathrooms and access to the Brawner Farm Visitor Center. One of two parking areas that accesses the Brawner Farm Loop Trail. Driving tour stop number one. Park in designated spaces only. No equestrian parking.","index":34,"latitude":38.813887127502056,"longitude":-77.56804141666223,"name":"Brawner Farm Parking Area"},{"description":"Located at the top of the wheeler peak scenic drive, this parking lot is at the base on some of the most popular trails.","index":35,"latitude":39.0101,"longitude":-114.3078,"name":"Bristlecone Parking lot"},{"description":"This parking lot is approximately 1 mile west of Hartwell Tavern on Rt 2A. Access to the Battle Road Trail","index":36,"latitude":42.453132,"longitude":-71.307942,"name":"Brooks Hill parking lot"},{"description":"Parking lot for Brownsville Picnic Area. Parking for equestrian trailers and access to equestrian trails. Please keep domestic pets distant from horses. Park in designated spaces only.","index":37,"latitude":38.80269784828055,"longitude":-77.54914313241386,"name":"Brownsville Picnic Area Parking Lot"},{"description":"A small gravel parking lot at the Bull Point Trailhead with space for ~10 vehicles. Park here to hike the Bull Point Trail, with begins at the eastern corner of the lot. There is a bulletin board with information about the Bull Point Trail adjacent to the trailhead. The Bull Point Trailhead Parking Lot is approximately 25 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":38,"latitude":38.08109276099103,"longitude":-122.96046495780269,"name":"Bull Point Trailhead Parking Lot"},{"description":"This parking lot is for busses, RVs, and oversized vehicles only. Regular-sized vehicles should park in the regular Visitor Parking Lot located south of the visitor center. To enter the parking lot, visitors need to drive down 7th street, which is a one-way street running north to south. Entrance to bus lot is on the right, right after the church and right before the Lincoln Home Visitor Center.","index":39,"latitude":39.7978358004,"longitude":-89.6460928995,"name":"Bus/Oversized Vehicle Parking Lot"},{"description":"Cadillac Mountain summit and Blue Hill Overlook","index":40,"latitude":44.3526,"longitude":68.2251,"name":"Cadillac Mountain"},{"description":"Located at Camp Round Meadow on Manahan Road. Provides trail access: Brown's Farm Trail (connects to Catoctin National Recreational Trail and Horse Trail). Map and bulletin board at northern section. Two electric vehicle charging stations.","index":41,"latitude":39.644398,"longitude":-77.487385,"name":"Camp Round Meadow Parking Lot"},{"description":"Medium sized paved lot that provides access to the Canal Exploration Center, the Canal Exploration Center Station, and the Towpath Trail. The lot has a total of 92 spaces with 3 designated accessible spaces. Next to the lot is an accessible restroom with flushing toilets and a water fountain.","index":42,"latitude":41.3725323,"longitude":-81.61413206,"name":"Canal Exploration Center Lot"},{"description":"Canyon Mouth Park is the second largest parking area at Little River Canyon National Preserve, and is in the only fee area of the park. Picnic benches, a multi-stall restroom with running water and flushing toilets, a playground, numerous soccer goals, the Canyon Mouth Trail, and easy river access can be found near the parking areas. Access can be had at the entry gate during open hours. Should staff not be on duty, the fee machine is available and is cash only (America the Beautiful passes accepted too).","index":43,"latitude":34.17178,"longitude":85.405592,"name":"Canyon Mouth Park"},{"description":"The gravel parking lot for the Canyon View overlook is located on Alabama Highway 176 / Little River Canyon Rim Parkway and features picnic benches, a trash receptacle, an interpretive wayside panel about the canyon, and a spectacular railed overlook of Little River Canyon.","index":44,"latitude":34.215137,"longitude":85.393557,"name":"Canyon View Parking"},{"description":"This parking lot is located in front of the Canyon Visitor Education Center.","index":45,"latitude":44.734463,"longitude":-110.490576,"name":"Canyon Village"},{"description":"This is a small dirt parking lot. It can be found along the Cape Royal Road. Vehicles over 30 feet are not recommended. It is the trailhead for Cape Final.","index":46,"latitude":36.14555556,"longitude":-111.93527778,"name":"Cape Final Trailhead Parking Lot"},{"description":"This medium sized lot is located at the terminus of the Cape Royal Road. It is a dirt lot. Space can usually be found throughout the day. There are restrooms located here.","index":47,"latitude":36.12222222,"longitude":-111.94972222,"name":"Cape Royal Parking Lot"},{"description":"4 parking lots off the Carderock Exit for the Clara Barton Parkway. It is located between to the Potomac River and the C&O Canal. Carderock has a 200 person Pavilion that is available to rent. Access to the C&O Canal Towpath, Billy Goat Section C and the Carderock Climbing area which is a top-rope free climb area open to the public. It also serves as the primary parking area for the Marsden Tract Group Campground.","index":48,"latitude":38.972509,"longitude":-77.19997,"name":"Carderock"},{"description":"The Castillo visitor lot is located on park grounds approximately 100 yards from the ticket booth. Meters are provided by the City of St. Augustine; parking costs $2.50 per hour from 8 a.m. to 5 p.m. Parking is free between 5 p.m. and 8 a.m.","index":49,"latitude":29.896543,"longitude":-81.311635,"name":"Castillo Visitor Lot"},{"description":"This serves as employee parking for the Headquarters building, as well as visitors to the building, when space allows.","index":50,"latitude":36.1567,"longitude":-82.8374,"name":"Cemetery Headquarters Parking lot"},{"description":"Paved parking lot with 68 parking spaces. 0 spaces are accessible. An entrance pass, annual pass, or lifetime is needed to park in this lot. Visit https://www.nps.gov/indu/planyourvisit/fees.htm for more information.","index":51,"latitude":41.701488,"longitude":-86.948473,"name":"Central Avenue Beach"},{"description":"","index":52,"latitude":34.072465,"longitude":-84.122435,"name":"Chattahoochee Pointe"},{"description":"","index":53,"latitude":33.989638,"longitude":-84.257755,"name":"Chattahoochee River Environmental Education Center Parking Lot"},{"description":"2.5 miles north of the Visitor Center on Park Central Road. Provides trail access: Spicebush Trail, Catoctin National Recreational Trail, and Horse Trail. Restroom facilities (flush toilets, seasonal). Map and bulletin boards. Multiple picnic tables and above ground grills. May temporarily close due to winter weather and/or icy road conditions.","index":54,"latitude":39.647463,"longitude":-77.478311,"name":"Chestnut Picnic Area Parking Lot"},{"description":"A small paved parking lot with space for 20 vehicles. Park here to hike the Chimney Rock Trail, walk to the Elephant Seal Overlook, or visit the Historic Point Reyes Lifeboat Station. A vault toilet is located at the southeast corner of the parking lot. The Chimney Rock Parking Lot is approximately 45 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":55,"latitude":37.995124820787744,"longitude":-122.97973452396911,"name":"Chimney Rock Parking Lot"},{"description":"Parking lot off of Chinn Ridge Road. Closest parking to access the Chinn Ridge Trail. Also one of several access points for the Second Manassas Loop Trail. Driving tour stop number ten. Please park in designated spaces. No equestrian trailer parking.","index":56,"latitude":38.80666184843493,"longitude":-77.53489851227127,"name":"Chinn Ridge Parking Lot"},{"description":"parking lot entrance is on Hospital Street, at the foot of Queen Street.","index":57,"latitude":17.746142,"longitude":-64.701956,"name":"Christiansted National Historic Site Parking Lot"},{"description":"This parking lot provides access to the Citadel Pueblo Trail. The parking lot is parallel to the road with an entrance/exit on both sides. There are 7 single car spaces, 2 accessible spaces, and 5 oversize vehicle spaces available.","index":58,"latitude":35.5657986499,"longitude":-111.470310688,"name":"Citadel Pueblo"},{"description":"Large paved parking area for access to General Grant's Headquarters, the Eppes family home and dependencies, and the Appomattox River.","index":59,"latitude":37.31499,"longitude":-77.277029,"name":"City Point Parking Lot"},{"description":"This is a very small unmarked pullout. It is found right before the hill going up to Cape Royal. It is not recommended for vehicles over 30 feet.","index":60,"latitude":36.12461111,"longitude":-111.94777778,"name":"Cliff Springs Trailhead Parking Lot"},{"description":"Space for parking at the Coast Trailhead consists of an approximately 300-foot-long unpaved shoulder along the south side of the Laguna Road (e.g., across the road from the hostel). There are no other facilities or amenities at this location. This trailhead is approximately 15 minutes by car from the Bear Valley Visitor Center via Limantour Road and Laguna Road. Space is limited. Please make sure your vehicle is completely off the pavement.","index":61,"latitude":38.04378200621828,"longitude":-122.86337435245514,"name":"Coast Trailhead Roadside Parking"},{"description":"Colter Bay Village parking lot is a paved 464-car lot with 18 designated handicapped parking spaces. The lot has 68 oversized spaces for RVs, boats, and buses. Restrooms are located at the visitor center, general store, and marina. The parking area provides access to the general store, visitor center, marina, amphitheater, and several trailheads. Wait time for spaces is minimal. No overnight parking allowed.","index":62,"latitude":43.905559,"longitude":-110.640113,"name":"Colter Bay Main Parking Lot"},{"description":"","index":63,"latitude":33.92159,"longitude":-84.439441,"name":"Columns Drive Parking Lots"},{"description":"A small dirt/gravel parking lot with space for 40 vehicles at the entrance to Commonweal. Access to unmaintained trails on the Niman Ranch/Commonweal area is available along the lot's southeast edge. Or walk along the Commonweal Road for 0.4 miles to the southwest to where a trail heads south from the road. There are no other facilities or amenities at this location. The Commonweal Entrance Parking Lot is ~25 minutes by car from the Bear Valley Visitor Center via Highway 1, Olema–Bolinas Road, & Mesa Road.","index":64,"latitude":37.91838987651509,"longitude":-122.72011608293292,"name":"Commonweal Entrance Parking Lot"},{"description":"The parking lot at the Confederate Cemetery has 7 regular spaces and 1 handicapped accessible space. This parking area provides access to the Confederate cemetery, Civil Rights in Education Heritage Trail sign, the Stage Road trail, and after-hours access to the historic village space (closes at sunset). From the Stage Road Trail, visitors can also access the Sweeney Trail, Ferguson Wildlife Trail, and the Conner-Sweeney Cabin Trail. The Confederate Cemetery is maintained by the Appomattox Chapter, UDC.","index":65,"latitude":37.376,"longitude":-78.8031,"name":"Confederate Cemetery"},{"description":"The park is new, and therefore there are no facilities or designated trails yet. Park at the graded dirt pull-off area on the south side of Corn Creek Road to view the interpretive kiosk and describes the natural history of the Tule Springs area during the Late Pleistocene Ice Age, geology, safety tips, park regulations, and locate yourself on the map. Enter the park from here by foot for a self-directed hike across the flat desert creosote-scrub landscape.","index":66,"latitude":36.4257777778,"longitude":-115.4228888889,"name":"Corn Creek Road Parking Area"},{"description":"Craig Thomas Discovery and Visitor Center parking lot is a paved 180-car lot with designated handicapped parking spaces. The lot has 20 oversize spaces for RVs, boats, and buses. Restrooms are available inside the visitor center. Wait times for spaces are minimal. No overnight parking allowed.","index":67,"latitude":43.654319,"longitude":-110.717253,"name":"Craig Thomas Discovery and Visitor Center Parking Lot"},{"description":"This lot is the closest parking lot to the Cross Estate, its gardens, and the hiking trails associated with the New Jersey Brigade encampments. Visitors must walk to those locations from this point on. The parking lot is rough, unlined, and unpaved. Visitors may not park in the grass.","index":68,"latitude":40.74826484276548,"longitude":-74.55915570259094,"name":"Cross Estate Parking"},{"description":"There is limited parking for the Cross Marin Trail along the old (now largely decommissioned) route of Sir Francis Drake Boulevard north of and parallel to the current highway west of the bridges that cross Lagunitas Creek. (The Old Tocaloma/Platform Bridge is closed to autos.) Additional roadside parking is available along the west side of Platform Bridge Road just north of its intersection with Sir Francis Drake Blvd. This trailhead is approximately 5 minutes by car from the Bear Valley Visitor Center.","index":69,"latitude":38.050097651579705,"longitude":-122.76049017906189,"name":"Cross Marin Trailhead Roadside Parking"},{"description":"The gravel parking for Crow Point is located along Alabama Highway 176 / Little River Canyon Rim Parkway and features picnic benches and a railed overlook of Little River Canyon and the confluence of Little River and Bear Creek.","index":70,"latitude":34.211489,"longitude":85.401948,"name":"Crow Point Parking"},{"description":"All visitors to Cumberland Island should park in the lot one block west of the Mainland Visitor Center. The tree covered lot is located on the block between Wheeler St. and Seagrove St., behind the park headquarters building. There are two entrances along St. Marys Street and one entrance along Stable Alley. Bus, RV, and over sized parking spaces are located along Seagrove Street.","index":71,"latitude":30.720997,"longitude":-81.551229,"name":"Cumberland Island Visitor Parking"},{"description":"","index":72,"latitude":37.738658546314696,"longitude":-119.56951008904117,"name":"Curry Village"},{"description":"Only visitor parking lot in the park. Site is a connecting loop with twelve parking spots. Two spots are reserved for visitors with disabilities.","index":73,"latitude":27.5238,"longitude":-82.6441,"name":"De Soto National Memorial Parking Lot"},{"description":"Parking lot off of Featherbed Lane. One of two lots that gives access to the Deep Cut Loop Trail. One of several access points to the Second Manassas Loop Trail. Driving tour stop number seven. Please park in designated spaces only. No equestrian trailer parking.","index":74,"latitude":38.82071957548882,"longitude":-77.54927834362158,"name":"Deep Cut Parking Lot"},{"description":"Main parking for the New Castle Court House and town. Free, no time limit.","index":75,"latitude":39.659919,"longitude":-75.563692,"name":"Delaware Street Parking"},{"description":"This public parking area is immediately east of the Delta-01 Launch Control Facility. A restroom and interpretive shelter is located adjacent the sidewalk connecting the parking lot to the historic compound of Delta-09 immediately to the west. It is open 9:00 a.m. - 3:00 p.m. daily, Mountain Time. No overnight parking is allowed. This parking lot is closed in the off-season from November 1 through April 1 annually.","index":76,"latitude":43.87852,"longitude":101.959416,"name":"Delta-01 Parking Area"},{"description":"This public parking area is immediately north of the Delta-09 Launch Facility. A restroom and interpretive shelter is located next to the parking lot. The silo is located a short walk to the south of the parking area. It is open from 9:00 a.m. to 3:00 p.m. daily, mountain time. No overnight parking is allowed. In event of winter weather conditions, this parking facility is cleared last. Severe winter storms may cause this facility to close until such time as it can be made safe.","index":77,"latitude":43.9328,"longitude":-102.159563,"name":"Delta-09 Parking Area"},{"description":"This parking lot is at the building where most bus trips into Denali begin. Two-thirds of the lot are sized for small cars, and one-third is sized for RVs or other large vehicles. Many area hotels have shuttles that bring their guests to the Denali Bus Depot, so inquire at your lodging if you want to avoid bringing a car to the park.","index":78,"latitude":63.736573,"longitude":-148.897455,"name":"Denali Bus Depot Parking"},{"description":"This is the only parking area for Desert View. It is split into two lots. As you enter Desert View, the lot on the right is for cars only. The lot of the left is for buses and RVs.","index":79,"latitude":36.04083333,"longitude":-111.82777778,"name":"Desert View Parking Lot"},{"description":"","index":80,"latitude":19.40647,"longitude":-155.252939,"name":"Devastation Trail Parking Lot"},{"description":"Devils Garden is located at the northern end of the park, 18 miles (28 km) from the park entrance. Park here for the trail to Landscape Arch and beyond. Limited oversize parking is available. Toilets are open year-round. Drinking water is available spring through fall.","index":81,"latitude":38.78281108613456,"longitude":-109.59502816200255,"name":"Devils Garden Parking Lot"},{"description":"The Dismal Nitch Rest Area is located near, although not exactly on, the original site used by Lewis and Clark. This parking lot has 34 total spaces available including 4 ADA and 9 RV spaces. This site has picnic benches, restrooms, trash cans, and a leashed pet area available for use.","index":82,"latitude":46.2489,"longitude":-123.86132,"name":"Dismal Nitch Parking Lot"},{"description":"","index":83,"latitude":31.99368140707135,"longitude":-104.83411431892216,"name":"Dog Canyon Trailhead"},{"description":"","index":84,"latitude":33.010674,"longitude":-84.337828,"name":"Don White Gravel Parking Lot"},{"description":"","index":85,"latitude":34.010105,"longitude":-84.332551,"name":"Don White Parking Lots"},{"description":"A paved parking lot with space for ~300 vehicles at Drakes Beach adjacent to the Kenneth C. Patrick Visitor Center. There are restrooms, a bookstore, picnic tables, and litter and recycling receptacles available at Drakes Beach. The Drakes Beach Parking Lot is approximately 30 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":86,"latitude":38.02788821243588,"longitude":-122.96215836354332,"name":"Drakes Beach Parking Lot"},{"description":"The Drakes Estero Parking Lot is a small dirt/gravel parking lot that can accommodate ~20 vehicles. A kayak/canoe launch site is at the southwest corner of the lot. A vault toilet building and litter and recycling receptacles are located along the south side of the lot. The Drakes Estero Parking Lot is approximately 20 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":87,"latitude":38.08291003929645,"longitude":-122.93208684539623,"name":"Drakes Estero Kayak/Canoe Launch Parking Lot"},{"description":"Located on Desert View Drive at mile marker 246, this unmarked parking lot is just east of Yaki Point.","index":88,"latitude":36.01416667,"longitude":-112.06555556,"name":"Duck on a Rock Parking Lot"},{"description":"Dunbar Beach parking lot is paved and has facilities located within the parking lot.","index":89,"latitude":41.683551,"longitude":-87.002856,"name":"Dunbar Beach"},{"description":"This beach accessible parking lot is located South of the main park entrance and allows easy access to the area beach.","index":90,"latitude":29.712447,"longitude":-81.230053,"name":"East Oceanside Boardwalk"},{"description":"This parking area on Sawmill Creek Road is across from the Post Office.","index":91,"latitude":57.04983161342949,"longitude":-135.3141422856443,"name":"East Unit Parking Lot"},{"description":"The gravel and pavement parking at the Eberhart Point overlook and Eberhart Trail is located on Alabama Highway 176 / Little River Canyon Rim Parkway and features numerous picnic tables, trash receptacles, a vault toilet, the beginning of the Eberhart Trail, and two railed overlooks of Little River Canyon. When parking alongside the paved road around the picnic area, ensure your vehicle is outside the painted lines on the road.","index":92,"latitude":34.210871,"longitude":85.403412,"name":"Eberhart Point Parking"},{"description":"Parking lot for Echo Lake Swim Beach, Beech Cliff Trail and Canada Cliffs Climbing. Lot closed to recreational vehicles (RVs) and trailer. Only buses with permits are allowed.","index":93,"latitude":44.314308,"longitude":-68.336482,"name":"Echo Lake"},{"description":"There are 9 boat trailer parking spaces and 1 ADA boat trailer parking space. 29 other parking spaces are also present. A pavilion, restrooms, fishing dock and a police call box can be found here as well.","index":94,"latitude":28.40557,"longitude":-80.38821,"name":"Eddy Creek Parking Lot"},{"description":"","index":95,"latitude":19.295039,"longitude":-155.098597,"name":"End of Chain of Craters Road Parking"},{"description":"Large, unpaved, gravel parking area that does not have designated spaces except for handicapped parking area nearest the entrance station building. The lot is large enough for large RVs or vehicles pulling trailers to turn around as long as the lot is not filled to capacity.","index":96,"latitude":35.86,"longitude":-106.48,"name":"Entrance Station Parking Lot"},{"description":"The Estero Trailhead Parking Lot is a small dirt parking lot with space for ~30 vehicles on the west side of Estero Trailhead Road (aka Home Ranch Road) one mile from Sir Francis Drake Boulevard. The Estero Trailhead is at the southwest corner of the lot. A vault toilet building and litter and recycling receptacles are located at the northeast end of the lot. A picnic table is located along the southern edge of the lot. This lot is approximately 25 minutes by car from the Bear Valley Visitor Center.","index":97,"latitude":38.08162638061697,"longitude":-122.91407400282401,"name":"Estero Trailhead Parking Lot"},{"description":"This parking lot is located approximately six miles (9.6 km) north of Old Faithful near the Firehole River.","index":98,"latitude":44.515399,"longitude":-110.832505,"name":"Fairy Falls Parking Lot"},{"description":"The farm side parking lot is a gravel parking lot without individual spaces. The lot is located next the farm building clusters behind the mule barn. The lot gives visitors easy access to the overseer's house, slave quarters, log house, and other farm side structures. The lot can hold up to 30 vehicles and is open 8:30 am - 5:00 pm. Cars cannot be left in the parking lot over night.","index":99,"latitude":39.4211,"longitude":-76.5874,"name":"Farm Side Parking Lot"},{"description":"This parking lot is just off of Rt. 2A in Lexington near the eastern trailhead of the Battle Road Trail","index":100,"latitude":42.447426,"longitude":-71.263899,"name":"Fiske Hill/Old Mass Ave"},{"description":"This parking lot sits at the eastern trailhead of the Battle Road Trail at the corner of Old Mass Ave and Wood Street, Lexington.","index":101,"latitude":42.44811,"longitude":-71.25654,"name":"Fiske Hill/Wood Street parking lot"},{"description":"A dirt/gravel parking lot at Five Brooks with space for ~50 vehicles and 10 or so trucks pulling horse trailers. There is a vault toilet adjacent to the parking lot and multiple picnic tables along the Stewart Trail, which heads northwest from the northern end of the lot. The Five Brooks Parking Lot is approximately 10 minutes by car from the Bear Valley Visitor Center via Highway 1.","index":102,"latitude":37.99725335121016,"longitude":-122.75767385959625,"name":"Five Brooks Parking Lot"},{"description":"This parking lot is found directly east of the Fort Clatsop Visitor Center and has accessible sidewalk and path access to the Visitor Center, Fort to Sea trail head, and picnic area. This parking lot has 38 general spaces, including 1 handicap spot. 7 R.V. only spaces are available both inside the lot and on the outside edge along the road.","index":103,"latitude":46.134993,"longitude":-123.88107,"name":"Fort Clatsop Visitor Center Overflow and R.V. Parking Lot"},{"description":"This parking lot is directly beside the Fort Clatsop Visitor Center, providing sidewalk and wheelchair access to the Visitor Center and to the Fort to Sea trail head and picnic area. This parking lot has 36 general parking spaces, including 2 handicap spots. R.V. parking is available in the Fort Clatsop Visitor Center Overflow Lot.","index":104,"latitude":46.133892,"longitude":-123.88052,"name":"Fort Clatsop Visitor Center Parking Lot"},{"description":"A small parking lot allows visitors to park their vehicles while they explore the area on top of Kinney Hill, where Fort Nonsense once stood.","index":105,"latitude":40.79349803762575,"longitude":-74.48848485946655,"name":"Fort Nonsense"},{"description":"","index":106,"latitude":32.0278723826,"longitude":-80.892254591,"name":"Fort Pulaski Parking Area"},{"description":"","index":107,"latitude":32.0309448919,"longitude":-80.9006938934,"name":"Fort Pulaski Picnic Area Parking"},{"description":"This is a free parking area provided by the City of Rome, NY. ***NOTE: Large vehicles will not fit into this parking area.***","index":108,"latitude":43.211502129184765,"longitude":-75.45706272125244,"name":"Fort Stanwix Parking Garage"},{"description":"This small parking lot provides accessible spots to get onto the Fort to Sea and other local trails as well as a restroom. In total there are 6 parking spots including 1 ADA space. There are no spots for RVs here, please visit the Fort Clatsop Visitor Center Parking Lot or South Netul Landing Parking Lot.","index":109,"latitude":46.13388,"longitude":-123.88526,"name":"Fort to Sea Trail Parking Lot"},{"description":"This is trailhead parking for the Smith Springs, Frijole, and Foothills trails as well as access to the historic Frijole Ranch museum. There are a total of 16 car parking spaces, plus 2 accessible spaces. Large vehicle parking is along the outside edge of the parking lot. The road and parking lot are gravel and accessible by all vehicles.","index":110,"latitude":31.90662,"longitude":-104.80155,"name":"Frijole Ranch"},{"description":"","index":111,"latitude":34.124725,"longitude":-84.091608,"name":"Ga. 20 / Cumming Highway Parking Lot"},{"description":"Free - General public parking is available in the gravel lot across the street from the front entrance of the Visitor Center. When parking please use the sidewalk to get to the Visitor Center, as walking through the grass wears a path in the historic playground. ADA Parking is available behind the Visitor Center.","index":112,"latitude":39.03729,"longitude":-95.67566,"name":"General Parking"},{"description":"General and accessible parking is available on the north and south sides of the visitor center. The parking area is also equipped for busses and large recreational vehicles (RVs).","index":113,"latitude":36.986334,"longitude":-94.354557,"name":"George Washington Carver National Monument"},{"description":"","index":114,"latitude":37.72695579180243,"longitude":-119.57529809065706,"name":"Glacier Point"},{"description":"","index":115,"latitude":33.984576,"longitude":-84.385285,"name":"Gold Branch Parking Lot"},{"description":"The gravel parking at the Graces High Falls overlook is located on Alabama Highway 176 / Little River Canyon Rim Parkway and features a short boardwalk with a view of Graces High Falls (a seasonal waterfall typically running in winter and spring) and an interpretive wayside panel about the waterfall.","index":116,"latitude":34.212888,"longitude":85.40411,"name":"Graces High Falls Parking"},{"description":"This parking lot is located on the South Rim Drive south of Canyon Village.","index":117,"latitude":44.719327,"longitude":-110.480889,"name":"Grand Canyon of the Yellowstone: Artist Point Parking Lot"},{"description":"This parking lot is located south of Canyon Village on the North Rim Road near Brink of the Lower Falls Trailhead.","index":118,"latitude":44.719698,"longitude":-110.497531,"name":"Grand Canyon of the Yellowstone: North Rim Parking Lot"},{"description":"This parking lot is located south of Canyon Village off of the Grand Loop Road near the Brink of the Upper Falls.","index":119,"latitude":44.714469,"longitude":-110.50088,"name":"Grand Canyon of the Yellowstone: Upper Falls Parking Lot"},{"description":"This parking lot is located south of Canyon Village off of the South Rim Drive.","index":120,"latitude":44.715003,"longitude":-110.495785,"name":"Grand Canyon of the Yellowstone: Upper Falls Viewpoints Parking Lot"},{"description":"This parking lot is located south of Canyon Village on the South Rim Drive.","index":121,"latitude":44.707891,"longitude":-110.500767,"name":"Grand Canyon of the Yellowstone: Wapati Lake Parking Lot"},{"description":"Located along Desert View Drive, this parking lot and viewpoint offers panoramic views of Grand Canyon from east to west, including several bends of the Colorado River to the east. This parking lot is located in between Moran Point and Duck on a Rock overlook. The historic Grandview Trail begins here.","index":122,"latitude":35.99722222,"longitude":-111.98805556,"name":"Grandview Point Parking Lot"},{"description":"Pull-off parking area with 11 regular parking spaces that provides access to wayside informational signs with information about General U.S. Grant's headquarters located nearby.","index":123,"latitude":37.3731,"longitude":-78.8174,"name":"Grant's Headquarters"},{"description":"A Medium sized lot at the Great Basin Visitor Center.","index":124,"latitude":39.02039,"longitude":-114.13101,"name":"Great Basin Visitor Center"},{"description":"486 Space Lot, with an upper and lower section which is all a one-way directional circuit with a traffic circle that is a shared entrance and exit. There are approximately 12 handicapped spaces.","index":125,"latitude":39.003036,"longitude":-77.246416,"name":"Great Falls"},{"description":"","index":126,"latitude":38.9972,"longitude":77.2549,"name":"Great Falls Park"},{"description":"Great Falls Park, VA","index":127,"latitude":38.9972,"longitude":77.2549,"name":"Great Falls Park"},{"description":"Weather - 70 degrees Sunny","index":128,"latitude":5.55,"longitude":6.22,"name":"Great Falls VA"},{"description":"Parking lot off of US 29. Closest parking lot to the Groveton Confederate Cemetery. One of several access points to the Second Manassas Loop Trail. Driving tour stop number eight. Park in designated spaces only. No equestrian trailer parking.","index":129,"latitude":38.813383870152485,"longitude":-77.54677028070975,"name":"Groveton Confederate Cemetery Parking Lot"},{"description":"Lowell National Historical Park visitors arriving in vehicles no larger than 6'8\" in height may park at the Hamilton Canal Innovation District parking garage at 350 Dutton St. Parking in this garage (only) is available to National Park visitors at no cost provided they obtain a valid parking voucher at either the LNHP Visitor Center or at the Boott Cotton Mills Museum. If you park in other City of Lowell garages or if you do not show a voucher when you exit you will be charged the posted rate.","index":130,"latitude":42.6434535,"longitude":-71.31462879999998,"name":"Hamilton Canal Innovation District Parking Garage"},{"description":"Two accessible parking spaces are available near the Gallatin House for those who cannot walk the 300 yd. uphill path from the main parking area. One spacei is van accessible. Bus/RV/Trailer parking is NOT available.","index":131,"latitude":39.77557,"longitude":-79.931425,"name":"Handicap Parking"},{"description":"This parking lot is on Rt 2A approximately 1 mile east of Minute Man Visitor Center. Access to Hartwell Tavern, William Smith House and Battle Road Trail","index":132,"latitude":42.451185,"longitude":-71.292224,"name":"Hartwell Tavern parking lot"},{"description":"The gravel and dirt parking area for the Hawk's Glide overlook is located on Alabama Highway 176 / Little River Canyon Rim Parkway and features picnic tables, a trash receptacle, and a railed overlook of Little River Canyon.","index":133,"latitude":34.220068,"longitude":85.385471,"name":"Hawk's Glide"},{"description":"Parking for the Henry Hill Visitor Center and Henry Hill Loop Trail. Also one of several parking lots along the First Manassas Loop Trail. Best to park here for Henry Hill Visitor Center based ranger programs, and the visitor center itself. This lot gets extremely crowded on weekends, please consider other parking areas that might allow easier access to your desired activity. Please park in designated spaces and do not park in the grass. No equestrian trailer parking.","index":134,"latitude":38.812693101818276,"longitude":-77.52124283832288,"name":"Henry Hill Visitor Center Parking"},{"description":"This lot is at the end of Hermit's Rest Road. It starts as a small paved lot. There is a dirt road that leads to a larger dirt lot with more spaces. Hermit's Rest Road is closed to private vehicles March through November. It is open to private vehicles December to February. If you park in this parking lot, do not block Shuttle Bus Service.","index":135,"latitude":36.06138889,"longitude":-112.21111111,"name":"Hermit's Rest Parking Lot"},{"description":"","index":136,"latitude":33.98708,"longitude":-84.325527,"name":"Hewlett Lodge Parking Lots"},{"description":"","index":137,"latitude":33.988788,"longitude":-84.325319,"name":"Hewlett Pond Parking Lot"},{"description":"The Hikers' Parking Lot located 1/2 mile down Little River Rd from the Visitor Parking Lot for visitors who are just coming to enjoy a hike in the park. This gravel lot accommodates up to 24 vehicles. From this lot visitors will walk 0.3 to .04 miles along a gravel road to the barn, house and trails.","index":138,"latitude":35.273921,"longitude":-82.452753,"name":"Hikers' Parking Lot"},{"description":"A pull-off is available on the street near the park entrance for visitors with limited mobility. Parking here is free of charge.","index":139,"latitude":43.20952376097985,"longitude":-75.45553922653198,"name":"Historic Fort Handicapped Parking"},{"description":"Public parking is available in front of the visitor center. Bus parking is available east of the visitor center.","index":140,"latitude":37.211281079593796,"longitude":-76.77731915928219,"name":"Historic Jamestowne Visitor Center Parking Lot"},{"description":"1.8 miles from the Visitor Center along Park Central Road. Provides trail access: Hog Rock Nature Trail, Blue Ridge Summit Trail, Visitor Center-Blue Ridge Summit Vista-Hog Rock Loop Trail, and 8 Mile Loop Trail. Vault toilet available seasonally. Map and Bulletin Boards. 6 Picnic Tables. May temporarily close due to winter weather, icy road conditions, or security closures.","index":141,"latitude":39.646684,"longitude":-77.453965,"name":"Hog Rock Parking Lot"},{"description":"12 acres, fishing, grill, playground, 0.25-mile non paved trail, and restrooms.","index":142,"latitude":33.972685,"longitude":-84.261974,"name":"Holcomb Bridge Park"},{"description":"The Homestead parking lot sits adjacent to the historic home.","index":143,"latitude":36.161,"longitude":-82.8319,"name":"Homestead Parking Lot"},{"description":"Parking Lot off of Greene Lane, at end of Hopewell Furnace Village. Approximately 20 vehicles.","index":144,"latitude":40.208029,"longitude":-75.77322,"name":"Hopewell Furnace Village Parking Lot"},{"description":"Parking for Horse Trailers only. Next to Chestnut Picnic Area. Provides trail access: Horse Trail. At Chestnut Picnic Area: restrooms, map and bulletin boards. The trails may temporarily close due to severe inclement weather conditions, or security closures.","index":145,"latitude":39.647524,"longitude":-77.478069,"name":"Horse Trailer Parking Lot"},{"description":"The Hoskins Farm Parking Lot is located at 2200 New Garden Road. These gates open at 8:30 AM and close at 5:00 PM, 7 days a week.","index":146,"latitude":36.129837,"longitude":-79.852763,"name":"Hoskins Farm Parking Lot"},{"description":"A medium paved lot with access to the Towpath Trail and Hunt Farm.","index":147,"latitude":41.20004635,"longitude":-81.5719882,"name":"Hunt Farm Lot"},{"description":"The Hyde Farm Park, located just off of Lower Roswell Road in East Cobb, is 42 acres of green space and a renovated/updated farm established in the 1830's. The land, farm, and buildings have been preserved as an educational and recreational facility. The drive down scenic Hyde Road cannot prepare you for your journey back in time. As you walk along the terrace gardens past the old farmhouse, or drink from the working well, it is hard to imagine that just a short distance away is East Cobb.","index":148,"latitude":33.96564,"longitude":-84.390646,"name":"Hyde Farm Parking Lots"},{"description":"","index":149,"latitude":33.884261,"longitude":-84.436902,"name":"Indian Trail Parking Lot"},{"description":"A small gravel lot with access to Indigo Lake, the Towpath Trail, and Indigo Lake Station. The size and location of the lot means it is usually full.","index":150,"latitude":41.1940348,"longitude":-81.5782189,"name":"Indigo Lake Lot"},{"description":"The Intersection Parking Lot is located off of Park Boulevard between the road and Hidden Valley Campground. The lot is named due to it's close proximity to the intersection of Park Boulevard and Barker Dam Road. This lot is a popular parking area for climbers going to a crag in or near the Hidden Valley Campground Area. The lot is relatively large, but it does fill up on weekends and holidays during the busy season.","index":151,"latitude":34.015043,"longitude":-116.163231,"name":"Intersection Parking Lot"},{"description":"","index":152,"latitude":33.902723,"longitude":-84.444451,"name":"Interstate North Parking Lot"},{"description":"A medium sized paved lot with access to the Towpath Trail and Beaver Marsh.","index":153,"latitude":41.18425931,"longitude":-81.58293701,"name":"Ira Trailhead Lot"},{"description":"","index":154,"latitude":33.995113,"longitude":-84.332382,"name":"Island Ferry Parking Lot"},{"description":"The Jacksonville State University Little River Canyon Center features a paved parking lot along the front side of the building and a gravel overflow parking area. This parking lot gives visitors access to the Little River Canyon Center, as well as to the Path to Learning Trail and the Bridge Trail leading into Little River Canyon National Preserve.","index":155,"latitude":34.235448,"longitude":85.380214,"name":"Jacksonville State University Little River Canyon Center"},{"description":"Jenny Lake parking lot is a paved 414-car lot with 17 designated handicapped parking spaces and nine RV only spaces. Restrooms are available in the parking lot and by the visitor center. Wait times for spaces are high at peak. Overnight parking is only allowed for those with a backcountry permit.","index":156,"latitude":43.751387,"longitude":-110.7214,"name":"Jenny Lake Parking Lot"},{"description":"A spot on the west side of the Jimmy Carter Boyhood Home. Diagonal parking allows 4 vehicles to park . No RVs, buses, motor coaches, or large vehicles. There is no place to turn around and large vehicles have to go 1 mile, on a partially dirt road, to get back to the main highway.","index":157,"latitude":32.026196,"longitude":-84.434394,"name":"Jimmy Carter Boyhood Home - Front parking lot"},{"description":"Pulling through the main gate and following the road to the comfort station brings you to the main parking lot at the Jimmy Carter Boyhood Farm. This circular parking lot has spaces for passenger vehicles as well as over size vehicles. Passenger vehicles are asked to not park in the RV/Bus parking spots. Park on paved surfaces only. If the gate is closed or half closed , and you are in a passenger car, then proceed down the road and park next to the Carter Home on the paved spot on the side of the road.","index":158,"latitude":32.02669,"longitude":-84.432549,"name":"Jimmy Carter Boyhood Home - Rear Parking Lot"},{"description":"This parking lot affords easy access to many of Jockey Hollow's trails, including the Red, Blue, Yellow, and Green trails. The lot also has an information board, stocked with a pamphlet containing details about the Green Aqueduct Trail Loop's features.","index":159,"latitude":40.76852892871206,"longitude":-74.53408777713776,"name":"Jockey Hollow Trail Center"},{"description":"Situated by the Visitor Center, this is the largest lot in Jockey Hollow with walking access to the Visitor Center and the Wick House. Guests may drive to the Tour Road from here. Parking lot hours follow Park Grounds hours, which change with the seasons. This lot has spaces for horse trailers and access to the bridle trails. As in other lots, visitors are prohibited from parking outside of the lined spots, even and especially when the lot appears full.","index":160,"latitude":40.76145528251467,"longitude":-74.54246163368225,"name":"Jockey Hollow Visitor Center"},{"description":"","index":161,"latitude":33.946239,"longitude":-84.404258,"name":"Johnson Ferry North Gravel Parking Lot"},{"description":"","index":162,"latitude":33.945636,"longitude":-84.406047,"name":"Johnson Ferry North Paved Parking Lot"},{"description":"","index":163,"latitude":33.937567,"longitude":-84.413261,"name":"Johnson Ferry South Parking Lot"},{"description":"","index":164,"latitude":33.999,"longitude":-84.2479,"name":"Jones Bridge Boat Ramp Parking Lot"},{"description":"","index":165,"latitude":34.001147,"longitude":-84.239587,"name":"Jones Bridge Main Parking Lot"},{"description":"30 acres, pavilions, playground, Good Age Building, sand volleyball court, three soccer fields, river overlook areas for fishing, grill, meadow, and restrooms.","index":166,"latitude":34.000664,"longitude":-84.23334,"name":"Jones Bridge Park"},{"description":"Jordan Pond North lot and boat launch area","index":167,"latitude":44.321547,"longitude":-68.251892,"name":"Jordan Pond"},{"description":"Parking spaces are available around the building which is both a cultural center and a visitor center for Joshua Tree National Park.","index":168,"latitude":34.134786256213715,"longitude":-116.05716717312043,"name":"Joshua Tree Cultural Center Parking"},{"description":"","index":169,"latitude":39.879872,"longitude":-79.642832,"name":"Jumonville Glen Parking"},{"description":"Kaloko fishpond has a small parking area that is at the end of a gravel road (travelling south take the first right turn after Hina Lani St). The parking area provides access to a section of the Ala Kahakai Trail, which is the approx. 1.5 mile section of the parkʻs coastline. The parking area also provides a place to park for viewing of the Kaloko Fishpond Wall. Cars can travel on this gravel road. The gate is open from 8am-5pm.","index":170,"latitude":19.686758,"longitude":-156.032374,"name":"Kaloko Fishpond Parking Area"},{"description":"Space for parking at the Kehoe Beach Trailhead consists of approximately 850 feet of unpaved shoulder along both sides of Pierce Point Road. There is room for approximately 40 vehicles. A vault toilet building and litter and recycling receptacles are located at the trailhead. This trailhead is approximately 25 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard and Pierce Point Road. Space is limited. Please make sure your vehicle is completely off the pavement.","index":171,"latitude":38.152508133789176,"longitude":-122.9390287399292,"name":"Kehoe Beach Trailhead Roadside Parking"},{"description":"The parking lot for the Kelso Depot Museum/Visitor Center","index":172,"latitude":35.012816,"longitude":-115.651748,"name":"Kelso Depot"},{"description":"The parking lot is paved and there are facilities located on site.","index":173,"latitude":41.677357,"longitude":-87.00895,"name":"Kemil Beach"},{"description":"A large paved parking lot with access to Kendall Lake, the Loop Trail, Salt Run Trail, and Cross Country Trail. Access to wider Ledges Trail system from these trail systems is possible.","index":174,"latitude":41.21793419,"longitude":-81.52486642,"name":"Kendall Lake Lot"},{"description":"The main Keys View Parking Lot has space for about 30 vehicles in a paved circular parking area. Do not park over the curb or on vegetation. Improper parking may result in a fine. There are two ADA parking spaces available in this lot and the trail is paved. However the steep grade of the trail makes it inaccessible for some visitors. There is also a nearby viewpoint with ADA parking that is more accessible.","index":175,"latitude":33.927099387937425,"longitude":-116.18737046616906,"name":"Keys View Parking"},{"description":"This parking lot sits along the eastbound lane of interstate route 80 in New Jersey and offers close proximity to both the Delaware river and hiking on the Appalachian Trail and beautiful Mount Tammany with its breathtaking views of the river below and Mount Minsi on the opposite shore. There is no grilling and picnicking allowed at this location. The nearest area to grill is Turtle Beach located approximately 7 miles north on Old Mine Road. Note: Arrive early as this lot fills by 09:30 am on most weekends","index":176,"latitude":40.970094,"longitude":-75.12954,"name":"Kittatinny Point Main Lot"},{"description":"Access to the Knox's Quarters area, the Philander Chase Knox Estate, the Joseph Plumb Martin Trail, and the Covered Bridge.","index":177,"latitude":40.086219,"longitude":-75.451462,"name":"Knox's Quarters Parking Lot"},{"description":"Parking lot next to the Kris Eggle Visitor Center, off of Highway 85. No overnight camping is allowed in this parking lot.","index":178,"latitude":31.954927,"longitude":-112.800961,"name":"Kris Eggle Visitor Center Parking Lot"},{"description":"Kīlauea Iki Overlook is often used to access the Kīlauea Iki Trail and Nahuku (Thurston Lava Tube).","index":179,"latitude":19.416584,"longitude":-155.242891,"name":"Kīlauea Iki Overlook Parking Lot"},{"description":"Parking lot at Kīlauea Overlook on Crater Rim Drive","index":180,"latitude":19.423602,"longitude":-155.284341,"name":"Kīlauea Overlook Parking"},{"description":"Kīlauea Visitor Center Parking is used to access the visitor center, Volcano House hotel, Volcano Art Center Gallery, and various trails.","index":181,"latitude":19.429496,"longitude":-155.257103,"name":"Kīlauea Visitor Center Parking"},{"description":"A small dirt and grass area with space for ~35 vehicles serves as an overflow parking area for the Laguna Trailhead Parking Lot. It is located along the south side of Laguna Road west of the turnoff that leads into the Laguna Trailhead Parking Lot. Hikers can connect with the Laguna Trail via a short driveway at the east end of the Laguna Trailhead Parking Lot. This parking area is approximately 15 minutes by car from the Bear Valley Visitor Center via Limantour Road and Laguna Road.","index":182,"latitude":38.04374877295614,"longitude":-122.8597853124744,"name":"Laguna Trailhead Overflow Parking Area"},{"description":"A small paved parking lot at the Laguna Trailhead with space for 13 vehicles. This is the closest parking lot to the Coast Campground. Hikers can connect with the Laguna Trail via a short driveway at the east end of the parking lot. An overflow parking area is available along the south side of Laguna Road west of the turnoff that leads into the Laguna Trailhead Parking Lot. This parking lot is approximately 15 minutes by car from the Bear Valley Visitor Center via Limantour Road and Laguna Road.","index":183,"latitude":38.043414131573634,"longitude":-122.85845051064007,"name":"Laguna Trailhead Parking Lot"},{"description":"A public access boat ramp is available as well as parking for vehicles and trailers (for up to 14 days), PFDs for public use, two vault toilets and a picnicking area.","index":184,"latitude":58.672983,"longitude":-156.45898,"name":"Lake Camp Boat Access"},{"description":"The parking lot of Lake View is paved and accessible. Facilities and a shelter are also accessible. There are stairs down to the beach.","index":185,"latitude":41.686222,"longitude":-86.996077,"name":"Lake View"},{"description":"All campers, trailers, busses, and other large vehicles are welcome to park free of charge along the street within city limits. The James Street corridor is the most convenient location to access Fort Stanwix National Monument from after parking. On James Street, there is no limit to how long your vehicle can stay parked during your visit.","index":186,"latitude":43.21081400839198,"longitude":-75.45730412006378,"name":"Large Vehicle Parking"},{"description":"Access to the center will be impacted by Moose-Wilson Road Construction in 2022. Visit go.nps.gov/moosewilson. Laurance S. Rockefeller Preserve Center parking lot is a gravel 50-car lot with designated handicapped parking spaces. A restroom is available at the parking lot. Rangers and volunteers are generally available from June-September to provide information and queue vehicles for the next available space. Wait times for spaces can be from 30-90 minutes at peak. No overnight parking allowed.","index":187,"latitude":43.626777,"longitude":-110.773122,"name":"Laurance S. Rockefeller Preserve Center Parking Lot"},{"description":"A large 223-space parking lot that provides 8 accessible spaces and access to the Ledges shelter, trail, and restrooms.","index":188,"latitude":41.223414,"longitude":-81.51027,"name":"Ledges Trailhead Parking"},{"description":"The Lee's Headquarters parking lot features 12 regular parking spaces. This site provides access to the site of General R. E. Lee's headquarters by a .3 mile trail up the hill from the parking area, along with signs that describe Confederate decision making in the campaign's final days. Visitors can also access the Tobacco Prizery Nature Trail from this location, and the Tobacco Prizery Nature Trail connects to the Southside Connector Trail and ultimately the Grant's Approach Trail.","index":189,"latitude":37.3915,"longitude":-78.7836,"name":"Lee's Headquarters"},{"description":"A medium sized parking lot at the Lehman Caves Visitor Center","index":190,"latitude":39.00595,"longitude":-114.21903,"name":"Lehman Caves Visitor Center"},{"description":"Located approximately 2 miles from the Visitor Center along Route 77. Gravel parking area. Provides trail access to the Gateway Trail. Map Board at location for trail orientation. 2 Picnic Tables. The Lewis Area pond is located a short distance from this parking area. May temporarily close due to winter weather, icy road conditions, or other weather events.","index":191,"latitude":39.623835,"longitude":-77.42228,"name":"Lewis Area Parking"},{"description":"A gravel parking lot with space for ~250 vehicles. The path leading to Limantour Beach is at the parking lot's south end. The path leads past three vault toilet buildings, two picnic tables, and junctions with the Muddy Hollow Trail and Limantour Spit Trail before climbing over a small dune to arrive at the beach. The Limantour Beach Parking Lot is approximately 20 minutes by car from the Bear Valley Visitor Center via Limantour Road.","index":192,"latitude":38.028930630673685,"longitude":-122.88271591371273,"name":"Limantour Beach Main Parking Lot"},{"description":"The Limantour Beach South Parking Lot is a small paved parking lot that can accommodate 15 vehicles. It is located at the east end of a short spur road branching off of Limantour Road a short distance before arriving at the Limantour Beach Main Parking Lot. A vault toilet, litter and recycling receptacles, and a path leading to the beach are located at the east end of the lot. The Limantour Beach South Parking Lot is approximately 20 minutes by car from the Bear Valley Visitor Center via Limantour Road.","index":193,"latitude":38.02621340891767,"longitude":-122.87687671791514,"name":"Limantour Beach South Parking Lot"},{"description":"Located on Desert View Drive, the parking area is west of the Desert View Watchtower. From this viewpoint can be seen several points of interest. Hance Rapid is one of the many powerful whitewater rapids along the Colorado River. Unkar Delta was once home to ancestral Puebloan people and is the site of active archeological study. The Grand Canyon Supergroup is a unique rock strata at Grand Canyon, visible to this extent from only a few places on the South Rim.","index":194,"latitude":36.0325,"longitude":-111.85305556,"name":"Lipan Point Parking Lot"},{"description":"The Little River Falls Overlook parking lot is a gravel parking lot located on Alabama Highway 176 / Little River Canyon Rim Parkway and features a boardwalk overlook with a view upriver to Little River Falls, multiple picnic tables, and a trash receptacle. Parking during busy summer months is limited to 30 minutes only (valid when signs are posted).","index":195,"latitude":34.233623,"longitude":85.377267,"name":"Little River Falls Overlook"},{"description":"This 167 space paved parking lot is where visitors will find a boardwalk leading to a close-up view of the 35' high Little River Falls, a path leading to the sidewalk on the Alabama Highway 35 bridge over the Little River and leading to the Bridge Trail to the Little River Canyon Center, and the trailhead to .75 mile (one-way) Little Falls Trail. During busy summer weekends this parking lot is often full by 11:00 AM (CST) and may be closed until spots become available - please plan accordingly.","index":196,"latitude":34.2343,"longitude":85.37321,"name":"Little River Falls Parking Lot"},{"description":"The Visitor Center parking lot has 32 vehicle spaces, 5 RV/Bus parking spaces and 2 accessible spaces; parking is for visitors to the National Historic Site only. No overnight parking is allowed; all violators may be towed at their own expense. Bus/RV parking spaces are approximately 14 feet wide x 40 feet long.","index":197,"latitude":34.738126,"longitude":-92.297167,"name":"Little Rock Central High School National Historic Site Visitor Center"},{"description":"This is a 43-space accessible parking lot that serves the Lock 29 Trailhead (Towpath access) and the Peninsula Boarding Station for the Cuyahoga Valley Scenic Railroad.","index":198,"latitude":41.24341,"longitude":-81.549593,"name":"Lock 29 Trailhead Main Lot"},{"description":"This parking lot provides access to the Lomaki Pueblo Trail. The lot is a one way loop with 13 parallel single vehicle spaces, 2 accessible spaces, 3 commercial bus/RV/oversize vehicle space.","index":199,"latitude":35.5794994199,"longitude":-111.4682292938,"name":"Lomaki Pueblo"},{"description":"","index":200,"latitude":39.84359,"longitude":-75.555562,"name":"Lot #1"},{"description":"This is a very small square parking lot along Beaver Valley Road. You will need to walk along the road to access the trail that is about 10-15 feet from the parking lot. Please avoid walking in the road and walk in a single line if you have multiple people with you.","index":201,"latitude":39.839026,"longitude":-75.564552,"name":"Lot #2"},{"description":"This is the largest parking lot within the park, it provides immediate access to the picnic area and access to the Brandywine Creek. This parking lot fills up very quickly on weekends from Memorial Day to Labor Day.","index":202,"latitude":39.834513,"longitude":-75.575636,"name":"Lot #3 - Smith Bridge parking lot"},{"description":"This is a small, narrow parking lot along Ramsey Road. Larger vehicles may struggle to get in and out as there is little room to turn around.","index":203,"latitude":39.829115,"longitude":-75.569578,"name":"Lot #4 - Ramsey Parking Lot"},{"description":"Parking area off of Bakerton Road with access to the Lower Loop on Bolivar Heights. Park in designated area only.","index":204,"latitude":39.32369237043075,"longitude":-77.76607693083163,"name":"Lower Bolivar Heights Parking Area"},{"description":"The final U-turn into the gravel lot has a slight incline. The lot has walking access to the Southwind Nature Trail and the Davis Trail. Minimal turnaround space for campers and trailers.","index":205,"latitude":38.440407,"longitude":-96.557447,"name":"Lower Fox Creek Schoolhouse"},{"description":"This is a gravel parking lot, accessed by turning right at the stop sign at the end of the park road. There are two sections to this parking area. Travel through the parking lot is one-way. There will be a high amount of pedestrian traffic in this parking area, but no designated walkways. Please drive carefully.","index":206,"latitude":44.591431,"longitude":-104.720423,"name":"Lower Gravel Lot"},{"description":"The small gravel parking area for Lower Two Mile Trail is located on Alabama Highway 176 / Little River Canyon Rim Parkway.","index":207,"latitude":34.220843,"longitude":85.382736,"name":"Lower Two Mile Trail"},{"description":"Access to the temporary visitor center, restroom facilities, visitor information and services, Stop 1 on the Encampment Tour, and the Joseph Plumb Martin trail.","index":208,"latitude":40.101354,"longitude":-75.425734,"name":"Lower Visitor Center Parking Lot"},{"description":"Lupine Meadows Trailhead parking lot is a gravel 106-car lot. Restrooms are available in the parking lot. Wait times for spaces are high at peak. Overnight parking is only allowed for those with a backcountry permit.","index":209,"latitude":43.734657,"longitude":-110.741532,"name":"Lupine Meadows Parking Lot"},{"description":"The Lynn Overlook parking lot is a gravel parking lot located along Alabama Highway 176 / Little River Canyon Rim Parkway and features picnic tables, a trash receptacle, a sandstone glade, and a canyon overlook. This parking lot can be subject to heavy erosion and potholes in the rainy season. The parking lot is open from sunrise to sunset.","index":210,"latitude":34.230489,"longitude":85.373155,"name":"Lynn Overlook"},{"description":"The Magnolia/Mobil Station has 8 vehicle parking spaces and 1 accessible parking space; parking is for visitors to the National Historic Site only. No overnight parking is allowed; all violators may be towed at their own expense.","index":211,"latitude":34.73729,"longitude":-92.297253,"name":"Magnolia Mobil Gas Station"},{"description":"The Magnolia Plantation Parking lot has both car and RV / bus parking.","index":212,"latitude":31.54957584012405,"longitude":-92.94144071237764,"name":"Magnolia Plantation Parking Lot"},{"description":"The main parking lot is located adjacent to the park's main building, Youngsholm. It is directly to the west of the house and is separated into two areas, large enough for RV's and motor coaches to pull in to and to park.","index":213,"latitude":39.707,"longitude":83.89028,"name":"Main Parking"},{"description":"This lot is located south of the Visitor Center off the Intersection of Garland street and 3rd street. This parking lot is free. The Visitor Center and gallows (surrounded by the white fence) can be seen from this parking lot. The parking lot also includes accessible and bus/RV parking","index":214,"latitude":35.387382,"longitude":-94.430509,"name":"Main Parking"},{"description":"The main parking lot for Hampton NHS is located next to the visitor contact station. The lot has 49 parking spaces as well as 4 bus/RV spaces. Parking here gives visitor easy access to the visitor contact station as well as a path leading up towards the Hampton mansion. The parking lot opens at 8:30 am and closes at 5:00 pm. Cars can not be parked here over night.","index":215,"latitude":39.4159,"longitude":-76.59,"name":"Main Parking Lot"},{"description":"The main parking lot is on the left (southwest) side of the park entrance road just after the entry kiosk. It contains 101 regular parking stalls and six bus and RV stalls. Parking is free.","index":216,"latitude":42.204232,"longitude":-104.558708,"name":"Main Parking Lot"},{"description":"The main parking lot for Friendship Hill is at the end of the entrance road. It is a 300 yard walk from the parking area to the Gallatin House with a gain of 25 feet in elevation. Two accessible parking spots are available on the knoll near the Gallatin House for visitors with mobility or respiratory issues. Accessible restrooms are located at the Main Parking Lot. The lot is open from sunrise to sunset.","index":217,"latitude":39.7781,"longitude":-79.930886,"name":"Main Parking Lot"},{"description":"The parking lot has limited space available. During busy times of the year, overflow parking is provided in the adjacent field. Tram shuttle service is available from the parking lot to the historic core May through October.","index":218,"latitude":41.76162483797757,"longitude":-73.90027697337973,"name":"Main Parking Lot"},{"description":"Arriving at the Main Visitor Center Parking Lot, cars pass the fee station bearing to the left. The lot is an oval with the first of three parking spot sections on the right hand side. Accessible parking spots are located closest to the Visitor Center at the end of the first row. A second and third row of parking is located by bearing your vehicle to the left at the Visitor Center pathway in between the first row of parking and the park entrance road. Parking is available on both the right and left sides.","index":219,"latitude":32.343759875,"longitude":-90.8504605306,"name":"Main Visitor Center"},{"description":"The parking lot for the main visitor center at Fort Caroline is paved and includes large vehicle/bus parking. Crowded only on weekends.","index":220,"latitude":30.3869,"longitude":81.5004,"name":"Main Visitor Center Lot"},{"description":"The main visitor parking lot is located at 1800 Little River Road. First time visitors are encouraged to use this lot to start their visit. *Visitors may use the Flat Rock Playhouse lot directly across the street in the mornings until noon and in the afternoon when there is no play, please check the playhouse signs. *Visitors may park behind the Flat Rock Village Offices located at 110 Village Center Drive, Flat Rock, NC. It is a short walk to the park from this lot.","index":221,"latitude":35.273377,"longitude":-82.444626,"name":"Main Visitor Parking Lot"},{"description":"","index":222,"latitude":37.50662314324598,"longitude":-119.62924594964917,"name":"Mariposa Grove Welcome Plaza"},{"description":"The Marshall Beach Trailhead Parking Lot is a dirt lot located at the north end of L Ranch Road. The lot can accommodate ~20 vehicles. The Marshall Beach Trailhead is located at the northwest corner of the lot. There are no other facilities or amenities at this location. Overnight parking is prohibited.","index":223,"latitude":38.15410288067186,"longitude":-122.91965713554555,"name":"Marshall Beach Trailhead Parking Lot"},{"description":"Parking lot at the end of MD 227. Asphalt lot with two concrete boat ramps. Grass area adjacent to lot is for overflow parking.","index":224,"latitude":38.68536647312075,"longitude":-77.10133245602754,"name":"Marshall Hall"},{"description":"Parking lot off of Sudley Road. Access point for the Matthews Hill Loop Trail. Is one of several access points for both the First Manassas Loop Trail and the Second Manassas Loop Trail. Driving tour stop number four. Please park in designated spaces only. No equestrian trailer parking.","index":225,"latitude":38.82670121295178,"longitude":-77.53372805293114,"name":"Matthews Hill Parking Lot"},{"description":"The McClures Beach Trailhead Parking Lot is a paved parking lot that can accommodate ~25 vehicles. It is at the west end of a spur road heading downhill and to the west from the Tomales Point Traihead/Pierce Point Ranch parking lot. The McClures Beach Trailhead is located at the west end of the lot. A vault toilet building is at the northeast corner of the lot.","index":226,"latitude":38.18849263772363,"longitude":-122.95792134383316,"name":"McClures Beach Trailhead Parking Lot"},{"description":"Space for parking at the McCurdy Trailhead consists of approximately 100 feet of paved shoulder on the west side of Highway 1 (aka Shoreline Highway) a short distance north of Dogtown. There is room for up to five vehicles. The McCurdy Trailhead is on the east side of the road; the Olemy Valley Trailhead (South) is on the west side of the road. There are no other facilities or amenities at this location. This trailhead is approximately 15 minutes by car from the Bear Valley Visitor Center via Highway 1.","index":227,"latitude":37.94684570451589,"longitude":-122.7089273929596,"name":"McCurdy Trailhead Roadside Parking"},{"description":"","index":228,"latitude":34.13972222,"longitude":-84.09916667,"name":"McGinnis Ferry Parking Lot"},{"description":"","index":229,"latitude":33.995425,"longitude":-84.202523,"name":"Medlock Bridge Parking Lot"},{"description":"The Memorial Visitor Center Parking Lot is located in front of the Memorial Visitor Center. The lot contains 27 parking spaces on the South and North sides and contains an island in between the parking spaces. Three bus parking spaces are available on the East side. Handicap parking spaces are located on the Southeast section with access to the walkway which leads to the handicap entrance to the Memorial Visitor Center.","index":230,"latitude":38.113581,"longitude":-86.995942,"name":"Memorial Visitor Center Parking Lot"},{"description":"This parking lot is on Lexington Road in Concord, at the western trailhead of the Battle Road Trail","index":231,"latitude":42.458533,"longitude":-71.321945,"name":"Meriam's Corner parking lot"},{"description":"This parking lot offers visitors the chance to stop and stretch their legs on a short historic trail that depicts the history and use of the area by the Chinook and later Lewis and Clark's expedition. 13 regular parking spaces are available as well as 2 additional ADA spots.","index":232,"latitude":46.24731,"longitude":-123.91078,"name":"Middle Village - Station Camp Parking Lot"},{"description":"This parking lot is across the Firehole River near Grand Prismatic & Excelsior geysers.","index":233,"latitude":44.528951,"longitude":-110.836206,"name":"Midway Geyser Basin Parking Lot"},{"description":"This is the main visitor parking lot for Minute Man Visitor Center off of Rt. 2A in Lincoln MA, less than one mile from the I-95/128 exit 46B. Here you can access the Battle Road Trail.","index":234,"latitude":42.44928845900881,"longitude":-71.27270336404897,"name":"Minute Man Visitor Center parking lot"},{"description":"This is a pull through lot designed for oversize vehicles. Mohave Point is located along Hermit Road. Hermit Road is closed to private vehicles March through November. During that time, the road is only accessible via shuttle bus, walking, or biking. Hermit Road is open to private vehicles November through February. If parking here, do not block the shuttle bus stop.","index":235,"latitude":36.07133333,"longitude":-112.16583333,"name":"Mohave Point Parking Lot"},{"description":"A medium sized parking lot with 2 RV parking spots, first come first served. Please make sure you are 45 ft. in length or less before accessing our parking lot.","index":236,"latitude":34.6114111,"longitude":-111.8389262,"name":"Montezuma Castle Parking Lot"},{"description":"There are three spaces at the crest of Monument Hill, directly behind the Presidential burial plot.","index":237,"latitude":36.1555,"longitude":-82.838,"name":"Monument Hill Parking area"},{"description":"Located along Desert View Drive, west of the Desert View Watchtower, in between the Tusayan Museum and Grandview Point. It is a small parking lot with an overlook. There are three main rock groups visible from this parking lot.","index":238,"latitude":36.00472222,"longitude":-111.92416667,"name":"Moran Point Parking Lot"},{"description":"","index":239,"latitude":33.966018,"longitude":-84.382077,"name":"Morgan Falls River Dog Park Parking Lot"},{"description":"","index":240,"latitude":33.966018,"longitude":-84.382077,"name":"Morgan Falls River Park / Dog Park Parking Lot"},{"description":"North parking lot closed through mid-summer. Mormon Row parking area has two gravel lots with designated handicapped parking spaces. A bus turnaround is located near the gravel lots. Restrooms are located at the south parking lot. The parking areas provide access to Mormon Row and the Moulton Barns. No overnight parking allowed.","index":241,"latitude":43.665187,"longitude":-110.664373,"name":"Mormon Row Parking Lot"},{"description":"","index":242,"latitude":39.81783,"longitude":-79.58758,"name":"Mount Washington Tavern Parking"},{"description":"The parking lot is paved and facilities are located on site.","index":243,"latitude":41.706852,"longitude":-86.929907,"name":"Mt. Baldy"},{"description":"The Muddy Hollow Trailhead parking lot is a dirt/gravel parking lot that can accommodate ~15 vehicles. The Muddy Hollow Trailhead is at the southwest end of the parking lot. The Muddy Hollow Road Trailhead is at the north corner of the parking lot. There are no other facilities or amenities at this location. This parking lot is approximately 15 minutes by car from the Bear Valley Visitor Center via Limantour Road and Muddy Hollow Road.","index":244,"latitude":38.0480413962184,"longitude":-122.86938999209383,"name":"Muddy Hollow Trailhead Parking Lot"},{"description":"Access to Muhlenberg's Brigade (Stop 2 on the Encampment Tour), the Joseph Plumb Martin trail, and Redoubt 2.","index":245,"latitude":40.097553,"longitude":-75.424437,"name":"Muhlenberg's Brigade Parking Lot"},{"description":"Parking lot off of Murphy Road for the Murphy-Chambers Farm Trail. Access at 123 Murphy Road, Harpers Ferry, WV 25425. Park in designated area only.","index":246,"latitude":39.312554248628,"longitude":-77.76019921406466,"name":"Murphy-Chambers Farm Parking Area"},{"description":"Mushroom Rock is a unique sandstone formation located in the middle of Alabama Highway 176 / Little River Canyon Rim Parkway. Parking is located before Mushroom Rock when travelling in either direction on the road - DO NOT PARK ON THE PARTITION! This feature is located on a blind hill and turn on the road - drive slow and use extreme caution when walking or driving around Mushroom Rock.","index":247,"latitude":34.222777,"longitude":85.37533,"name":"Mushroom Rock"},{"description":"Parking is available at the Natchez Visitor Center.","index":248,"latitude":31.5537224497275,"longitude":-91.4125994787277,"name":"Natchez Visitor Center Parking Lot"},{"description":"This cemetery is usually used by relatives and friends visiting gravesites in the National Cemetery.","index":249,"latitude":36.155,"longitude":-82.8396,"name":"National Cemetery Lower parking area"},{"description":"Access to the National Memorial Arch, the Joseph Plumb Martin trail, and the Wayne's Woods Picnic Area.","index":250,"latitude":40.09115,"longitude":-75.439337,"name":"National Memorial Arch Parking Lot"},{"description":"Just a few minutes west of the Desert View Watchtower, this viewpoint offers a great view of the watchtower as well as panoramic vistas to the west and a view north up the Colorado River. Navajo Point is the highest overlook on the South Rim - unless one is standing on the top observation deck of the watchtower itself. The top of the tower measures slightly higher.","index":251,"latitude":36.055,"longitude":-111.8375,"name":"Navajo Point Parking Lot"},{"description":"This parking lot is for day use only. This parking area can accommodate cars, large vehicles, RVs, and trailers. No overnight parking allowed.","index":252,"latitude":30.364189,"longitude":-87.130529,"name":"Naval Live Oaks Area (sound side)"},{"description":"The New Hope Church pull off is a sizable roadside gravel space that provides access to a Civil War Trails informational wayside sign.","index":253,"latitude":37.417,"longitude":-78.7604,"name":"New Hope Church Pull Off"},{"description":"Parking lot off US 29 near the monuments to New York regiments in the Second Battle of Manassas. Park in designated spaces only. No equestrian trailer parking.","index":254,"latitude":38.81325291366885,"longitude":-77.54482904034066,"name":"New York Avenue Parking Lot One"},{"description":"Lot off of New York Avenue that is one of several access points to the Second Manassas Loop Trail and is driving tour stop number nine. Please park in designated spaces only. No equestrian trailer parking.","index":255,"latitude":38.810181532006474,"longitude":-77.54406370144149,"name":"New York Avenue Parking Lot Two"},{"description":"So named because of its proximity to the New York state troop's campsite, this parking lot allows access to the Blue Trail loop. A comfort station restroom is also located nearby. Visitors may exit and enter the park along Jockey Hollow Road, which leads to Western Avenue.","index":256,"latitude":40.772416878811576,"longitude":-74.52817618846893,"name":"New York Brigade"},{"description":"A small unmarked parking lot west of Desert View. It is located between Lipan Point and the Tusayan Ruin and Museum at mile marker 263.","index":257,"latitude":36.02416667,"longitude":-111.85527778,"name":"No Name Parking Lot"},{"description":"1.5 miles north of the Visitor Center along Park Central Road. No trail access. One Picnic Table. May temporarily close due to winter weather, icy road conditions, or security closures.","index":258,"latitude":39.645504,"longitude":-77.451832,"name":"No Name Parking Lot"},{"description":"This parking lot serves the Norris Geyser Basin (where Steamboat Geyser is located) and the Norris Geyser Basin Museum. The parking lot regularly fills during summer and you may see rangers directing vehicles at the intersection or parking lot. Follow their instructions, use overflow parking if necessary, and if overflow parking is full, be prepared to visit the site at a different time. (The trail from overflow parking to the site is approximately a half-mile.)","index":259,"latitude":44.457694,"longitude":-110.830667,"name":"Norris Geyser Basin Parking Lot"},{"description":"This parking lot is located on Liberty St. near North Bridge Visitor Center. From there it is a 5 minute/quarter mile walk to the North Bridge.","index":260,"latitude":42.472213,"longitude":-71.353064,"name":"North Bridge Visitor Center parking lot"},{"description":"This is the parking lot, on Monument Street, Concord, that is closest to the North Bridge","index":261,"latitude":42.468715,"longitude":-71.348257,"name":"North Bridge/Monument Street parking lot"},{"description":"The North Caroling Monument Parking Area features 10 regular spaces and 1 accessible parking space. This parking lot provides access to signs about the North Carolina monument located in the woods nearby. Visitors can also access the Grant's Approach loop trail here and from that trail, access the Southside Connector Trail, the Tobacco Prizery Nature Trail, and the Lee's Headquarters Trail (adding several miles).","index":262,"latitude":37.3755,"longitude":-78.8058,"name":"North Carolina Monument Parking Area"},{"description":"This is the parking lot for the North Kaibab Trail. It fills up early and quickly. It is located in a big bend on Highway 67 between the Cape Royal Road and the North Rim developed area.","index":263,"latitude":36.21722222,"longitude":-112.05611111,"name":"North Kaibab Trailhead Parking Lot"},{"description":"The North Netul Parking lot is one of two parking lots at Netul Landing. This parking lot gives access to picnic benches, trash cans, restrooms, and the beginning of the Netul Trail that hugs the Netul River. There are 48 spaces available here including 3 ADA spaces and 0 RV spots. For RV and over sized vehicle parking please park at the South Netul Parking lot.","index":264,"latitude":46.12097,"longitude":-123.87678,"name":"North Netul Parking Lot"},{"description":"Park entrance road, CR300, ends at the Road Closed sign. Parking lot is located on the right.","index":265,"latitude":38.118212,"longitude":-86.99736,"name":"North Parking Lot"},{"description":"This is a small parking lot that is often full with government vehicles. It is located on a side road off Highway 67. Look for signs for the Backcountry Information Center to find it.","index":266,"latitude":36.21444444,"longitude":-112.06138889,"name":"North Rim Backcountry Office Parking Lot"},{"description":"This parking lot is located at the end of a side road the leads to the North Rim Campground, general store, and other facilities. Follow signs to reach the North Rim Campground to reach this parking lot. It is usually empty earlier in the day but fills up later in the day.","index":267,"latitude":36.21055556,"longitude":-112.06,"name":"North Rim Campground Parking Lot"},{"description":"This parking lot is adjacent to the North Rim Visitor Center and Grand Canyon Lodge, at the end of Highway 67. It is the largest lot on the North Rim.","index":268,"latitude":36.19944444,"longitude":-112.05194444,"name":"North Rim Lodge and Visitor Center Parking Lot"},{"description":"Located at mile marker 12 on Highway 67, before the North Rim Grand Canyon Lodge and Visitor Center. This is an unmarked, small, dirt pull out.","index":269,"latitude":32.20666667,"longitude":-112.05388889,"name":"North Rim Picnic Area Parking Lot"},{"description":"","index":270,"latitude":19.41359,"longitude":-155.238811,"name":"Nāhuku (Thurston Lava Tube)"},{"description":"Oakland Plantation parking lot has both car and RV / bus parking available.","index":271,"latitude":31.666194748816,"longitude":-93.00374697849432,"name":"Oakland Plantation"},{"description":"A large paved lot, with tiered parking spaces. Octagon provides access to the Octagon Shelter, Ledges Trail system, and Forest Point Trail.","index":272,"latitude":41.22627896,"longitude":-81.51429853,"name":"Octagon Lot"},{"description":"This lot is located near the intersection of Old Battleground Road and New Garden Road. This paved and gravel lot is open to visitors from dawn to dusk, 7 days a week. The lot runs parallel to the Atlantic & Yadkin Greenway and Old Battleground Road. The gravel portion can accommodate large scale vehicles, as there are no designated spaces.","index":273,"latitude":36.133729,"longitude":-79.846056,"name":"Old Battleground Road Parking Lot"},{"description":"This parking lot is located south of the Old Faithful Visitor Education Center.","index":274,"latitude":44.457681,"longitude":-110.830667,"name":"Old Faithful Central Parking Lot"},{"description":"This parking lot is sandwiched between the Old Faithful Inn and the Old Faithful Lodge.","index":275,"latitude":44.457386,"longitude":-110.825867,"name":"Old Faithful East Parking Lot"},{"description":"This parking lot is located north of the the Old Faithful Inn.","index":276,"latitude":44.460707,"longitude":-110.831762,"name":"Old Faithful Inn Parking Lot"},{"description":"A small dirt parking lot with space for 10 vehicles adjacent to Olema Marsh. The Olema Marsh Trail departs from the northwest corner and intersects with Sir Francis Drake Boulevard about 1300 feet to the north. This parking area is approximately 5 minutes by car from the Bear Valley Visitor Center via Bear Valley Road.","index":277,"latitude":38.059912405571296,"longitude":-122.80967555162215,"name":"Olema Marsh Parking Lot"},{"description":"This is the parking lot for the main park visitor center, located in Port Angeles, WA. Visitors stop here for general park information/orientation, exhibits, park film, children's Discovery Room, sales area, back-country planning and permits at the Wilderness Information Center, nature trails, and restrooms. Special parking lane for RVs.","index":278,"latitude":47.802109,"longitude":-123.604355,"name":"Olympic National Park Visitor Center"},{"description":"Located on the Gulf of Mexico side of Highway 399, this parking lot has 56 parking spaces for passenger sized vehicles or smaller.","index":279,"latitude":30.3573,"longitude":-87.0055,"name":"Opal Beach Beach Access 32A"},{"description":"Behind the main Visitor Center Parking Lot for overflow and oversize vehicles","index":280,"latitude":40.208029,"longitude":-75.77322,"name":"Overflow and Oversize Visitor Center Parking Lot"},{"description":"","index":281,"latitude":33.970278,"longitude":-84.379619,"name":"Overlook Park Parking Lot"},{"description":"Parking lot entrance is located at 72 McBride Avenue Extension, Paterson, New Jersey, 07501.","index":282,"latitude":40.914952,"longitude":-74.179636,"name":"Overlook Parking Lot"},{"description":"Owens Creek Picnic Area along Foxville-Deefield Road. Provides trail access: Brown's Farm Trail, Horse Trail, Deerfield Nature Trail, and the Catoctin National Recreational Trail. Vault Toilet (seasonal). Map and bulletin board. May temporarily close due to winter weather and/or icy road conditions.","index":283,"latitude":39.652737,"longitude":-77.487956,"name":"Owens Creek Picnic Area Parking Lot"},{"description":"","index":284,"latitude":33.867813,"longitude":-84.454972,"name":"Paces Mill - Boat Ramp Parking Lot"},{"description":"","index":285,"latitude":33.870198,"longitude":-84.453659,"name":"Paces Mill - Main Parking Lot"},{"description":"This parking lot features a large space for RV and bus parking.","index":286,"latitude":26.016817,"longitude":-97.479429,"name":"Palo Alto Battlefield Visitor Center Overflow Parking Lot"},{"description":"There is now RV and/or bus parking at the visitor center parking lot. RV and bus parking can be found at the visitor center overflow parking lot and battlefield overlook parking lot.","index":287,"latitude":26.016817,"longitude":-97.479429,"name":"Palo Alto Battlefield Visitor Center Parking Lot"},{"description":"A small dirt/gravel parking lot with space for ~75 vehicles at the northwest end of Mesa Road. The Palomarin Trailhead is located along the north side of the eastern end of the parking lot, along with vault toilet buildings, litter and recycling receptacles, and informational signs. The Palomarin Parking Lot is approximately 35 minutes by car from the Bear Valley Visitor Center via Highway 1, Olema–Bolinas Road, and Mesa Road.","index":288,"latitude":37.934077606665916,"longitude":-122.74708449840546,"name":"Palomarin Trailhead Parking Lot"},{"description":"Park Headquarters Outer Area Parking (GPS Address: 6602 Foxville Road, Thurmont, MD 21788). This parking area is located along Route 77 directly in front of the Park Headquarters entrance gate. A bulletin board and orientation map board are located near the entrance to the parking area. Area provides fishing access to Big Hunting Creek.","index":289,"latitude":39.633853,"longitude":-77.448206,"name":"Park Headquarters Outer Area Parking"},{"description":"There is only one parking lot. It is a one-way, teardrop-shaped loop. Parking is free and the grounds never close, so visitors may access the site (and the Circle Trail) at any time.","index":290,"latitude":44.012423,"longitude":-96.32636,"name":"Parking Lot"},{"description":"Paved parking is available near the park visitor center.","index":291,"latitude":38.55114,"longitude":-90.35211,"name":"Parking Lot"},{"description":"Fort Davis National Historic Sites parking lot has 2 Van accessible handicapped parking spaces, 46 regulars parking spaces, 2 designated bus parking spaces, and 4 RV/travel trailer parking spaces.","index":292,"latitude":30.59649153566647,"longitude":-103.89140071886338,"name":"Parking Lot"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you to the Visitor Center Parking Lot Complex. As you approach from this direction, the four Visitor Center parking lots are numbered 1–4. Lot 1 is the closest of the four lots to Grand Canyon views, and is the only visitor center parking with pull-through spaces for RVs and vehicles with trailers, but is the second furthest from the visitor center itself.","index":293,"latitude":36.05861111,"longitude":-112.10638889,"name":"Parking Lot 1 - South Rim Visitor Center"},{"description":"As you drive into the Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you to the Visitor Center Parking Lot Complex. As you approach from this direction, the four Visitor Center parking lots are numbered, starting with Lot 1. Lot 2 is the second lot, and is closer to the visitor center, visitor center plaza, and bus transit center. There are no RV spaces in Lot 2.","index":294,"latitude":36.05833333,"longitude":-112.10722222,"name":"Parking Lot 2 - South Rim Visitor Center"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you to the Visitor Center Parking Lot Complex. As you approach from this direction, the four Visitor Center parking lots are numbered 1–4. Lot 3 is the third lot, and is the furthest away from the visitor center, visitor center plaza, and bus transit center. There are no RV spaces in Lot 3.","index":295,"latitude":36.05694444,"longitude":-112.10777778,"name":"Parking Lot 3 - South Rim Visitor Center"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you to the Visitor Center Parking Lot Complex. As you approach from this direction, the four Visitor Center parking lots are numbered 1–4. Lot 4 is the closest of the four lots to the visitor center and visitor center plaza. It is the second closest lot to the bus transit center. There are no RV spaces in Lot 4.","index":296,"latitude":36.05855556,"longitude":-112.11055556,"name":"Parking Lot 4 - South Rim Visitor Center"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you towards the Grand Canyon Village. Located near Park Headquarters, which is staffed with rangers who can provide park information. Across the street from Market Plaza. Tends fill in early afternoon. Does NOT have space for RVs or vehicles with trailers.","index":297,"latitude":36.05416667,"longitude":-112.12277778,"name":"Parking Lot A - Grand Canyon Village"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you towards the Grand Canyon Village. Located near the businesses in Market Plaza. This is the largest lot and has space for RVs and vehicles with trailers. Tends to fill in early afternoon. The Post Office, bank, General Store and Yavapai Lodge are located here.","index":298,"latitude":36.05333333,"longitude":-112.12027778,"name":"Parking Lot B - Grand Canyon Village"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you towards the Grand Canyon Village. This small lot in the village, near the intersection of Center and Village Loop Roads may have parking spots when others lots are filled. Does NOT have space for RVs or vehicles with trailers","index":299,"latitude":36.055,"longitude":-112.13861111,"name":"Parking Lot C - Grand Canyon Village"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you towards the Grand Canyon Village. This is a large lot near the Backcountry Information Center in the Village. May have parking spots when others lots are filled. The southern portion of this lot has large, pull-through spaces for RVs and vehicles with trailers.","index":300,"latitude":36.05333333,"longitude":-112.14305556,"name":"Parking Lot D - Grand Canyon Village"},{"description":"The visitor center parking lot is being remodeled and there is construction ongoing in and round the visitor center parking lot. There will be signs directing where parking is allowed. Please look out for signage and construction workers. We appreciate your understanding and cooperation and apologize for any inconvenience.","index":301,"latitude":36.443639,"longitude":-94.026033,"name":"Parking lot Remodel and Construction"},{"description":"This parking lot is a short distance west of Minute Man Visitor Center, on Rt 2A. Here you can access the Battle Road Trail and Paul Revere Capture Site","index":302,"latitude":42.448986,"longitude":-71.278506,"name":"Paul Revere Capture Site parking lot"},{"description":"This lot serves the picnic area and its accessible restrooms.","index":303,"latitude":42.203067,"longitude":-104.559806,"name":"Picnic Area Lot"},{"description":"The Picnic Area Parking Lot is open when Volcano Road is open, which is from 8:30 a.m. to 4:00 p.m. You can access the Lava Flow and Boca Trails from this parking area.","index":304,"latitude":36.779937,"longitude":-103.976903,"name":"Picnic Area Parking"},{"description":"Gravel lot at Fort Necessity Picnic Area, 1.25 mile from Visitor Center. Vault toilet available. Must travel on one mile of gravel road to enter and exit. Exit road is not suitable for oversize vehicles.","index":305,"latitude":39.809161,"longitude":-79.598252,"name":"Picnic Area Parking"},{"description":"This is a very small lot located along Hermit Road. Hermit Road is closed to private vehicles March through November. During that time it is only accessible via shuttle bus, walking, or biking. Hermit Road is open to private vehicles December through February. If you park here, make sure you are not blocking the shuttle bus operations.","index":306,"latitude":36.07138889,"longitude":-112.2,"name":"Pima Point Parking Lot"},{"description":"This is trailhead parking is for Guadalupe Peak, Devil's Hall, Bowl, and El Capitan Trails. Trailhead parking are the non-numbered spaces. There are a total of 44 car parking spaces, plus 2 accessible spaces. Overflow parking and parking for RV's can be found at the Pine Springs Visitor Center Parking Lot. A short trail from the visitor center through the campground connects the two locations.","index":307,"latitude":31.896423325819395,"longitude":-104.82787486391658,"name":"Pine Springs Trailhead"},{"description":"This is parking for the Pine Springs Visitor Center and the Pinery Nature Trail. This is also overflow parking for the Pine Springs Trailhead Parking. Parking for RV's can be found here. Note: when parking for cars becomes full, cars are allowed to started parking in the RV spots.","index":308,"latitude":31.89341,"longitude":-104.82262,"name":"Pine Springs Visitor Center"},{"description":"This is the first parking lot along Desert View Drive if coming from the west. If coming from the east, this is the last parking lot along Desert View Drive. This pullout can be accessed by private vehicle or by using the free Kaibab Rim Route (Orange) Shuttle Bus, departing from the Grand Canyon Visitor Center. The Canyon Rim Trail may be accessed here, with a 1.3 mile / 2.1 km walk on a paved trail west to Mather Point, or a 0.8 mile / 1.3 km walk east to the South Kaibab Trailhead.","index":309,"latitude":36.0475,"longitude":-112.0925,"name":"Pipe Creek Vista Parking Lot"},{"description":"The parking lot next to Plains Depot. No overnight parking. Lined spots for passenger vehicles. Large and oversized vehicles may be able to park in the lot, depending on vehicles already parked there.","index":310,"latitude":32.033218,"longitude":-84.39762,"name":"Plains Depot Parking Lot"},{"description":"The parking lot in from of Plains High School Parking is for passenger cars and trucks. No large vehicles, no RVs, no buses, no motor coaches. No parking on the grass. No overnight parking.","index":311,"latitude":32.036438,"longitude":-84.392509,"name":"Plains High School - Front Parking Lot"},{"description":"The parking lot in the rear of Plains High School. Parking for school buses, motor coaches, and oversize vehicles. No overnight parking. No sewer dump station. Accessible parking and wheelchair entry into Plains High School via the side walk and a ramp to the rear entrance; located next to the women's restroom.","index":312,"latitude":32.037038,"longitude":-84.392917,"name":"Plains High School - Rear Parking Lot"},{"description":"A beach access boardwalk, restrooms and a police call box are present.","index":313,"latitude":28.65465,"longitude":-80.631803,"name":"Playalinda Beach Parking Lot 1"},{"description":"","index":314,"latitude":28.41294,"longitude":-80.39424,"name":"Playalinda Beach Parking Lot 10"},{"description":"","index":315,"latitude":28.41647,"longitude":-80.39689,"name":"Playalinda Beach Parking Lot 11"},{"description":"","index":316,"latitude":28.4184,"longitude":-80.3983,"name":"Playalinda Beach Parking Lot 12"},{"description":"A beach access boardwalk, restrooms, and a police call box are present.","index":317,"latitude":28.42125,"longitude":-80.40031,"name":"Playalinda Beach Parking Lot 13"},{"description":"","index":318,"latitude":28.39414,"longitude":-80.38011,"name":"Playalinda Beach Parking Lot 2"},{"description":"","index":319,"latitude":28.39539,"longitude":-80.38103,"name":"Playalinda Beach Parking Lot 3"},{"description":"This is a beach access parking area. It has restrooms and a boardwalk.","index":320,"latitude":28.39658,"longitude":-80.38189,"name":"Playalinda Beach Parking Lot 4"},{"description":"","index":321,"latitude":28.40015,"longitude":-80.38437,"name":"Playalinda Beach Parking Lot 5"},{"description":"","index":322,"latitude":28.4015,"longitude":-80.38546,"name":"Playalinda Beach Parking Lot 6"},{"description":"","index":323,"latitude":28.40308,"longitude":-80.38659,"name":"Playalinda Beach Parking Lot 7"},{"description":"","index":324,"latitude":28.4069,"longitude":-80.38928,"name":"Playalinda Beach Parking Lot 8"},{"description":"","index":325,"latitude":28.41136,"longitude":-80.39295,"name":"Playalinda Beach Parking Lot 9"},{"description":"This parking lot is located at the end of the Point Imperial Road. It is accessed by taking Highway 67, next turning onto the Cape Royal Road, and then finally at the \"Y\" with the Cape Royal Road, following signs for Point Imperial. It is a small lot that is not recommended for vehicles over 30 feet.","index":326,"latitude":36.27888889,"longitude":-111.97833333,"name":"Point Imperial Parking Lot"},{"description":"A paved parking lot with space for 85 vehicles adjacent to the Point Reyes Beach North (aka North Beach). A restroom building is located at the lot's northeast end. The North Beach Parking Lot is approximately 25 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":327,"latitude":38.0771011276389,"longitude":-122.975025133013,"name":"Point Reyes Beach North Parking Lot"},{"description":"A paved parking lot with space for approximately 180 vehicles adjacent to the Point Reyes Beach South (aka South Beach. A restroom building is located along the lot's southwest side. The South Beach Parking Lot is approximately 30 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":328,"latitude":38.0478805243583,"longitude":-122.988010331441,"name":"Point Reyes Beach South Parking Lot"},{"description":"A small dirt parking lot with space for 20 vehicles at the southeast end of Mount Vision Road. The Inverness Ridge Trail departs from the lot's southeast corner. There are no other facilities or amenities at this location. This parking area is approximately 30 minutes by car from the Bear Valley Visitor Center via Bear Valley Road, Sir Francis Drake Boulevard, and Mount Vision Road.","index":329,"latitude":38.08419694333198,"longitude":-122.87099182605743,"name":"Point Reyes Hill Trailhead Parking Lot"},{"description":"The lighthouse area's accessible parking lot is located 0.4 miles beyond (to the west of) the main visitors' parking lot, which is located at the west end of Sir Francis Drake Blvd. Open, then close, the chain gate at the west end of the roundabout and drive along the service road, which doubles as a pedestrian path. The accessible parking lot is on the right side of the road just beyond the cypress trees. Please visit https://www.nps.gov/pore/planyourvisit/lighthouse.htm#accessibility for more details.","index":330,"latitude":37.996969014018404,"longitude":-123.01906382495511,"name":"Point Reyes Lighthouse Accessible (ADA) Parking Lot."},{"description":"A paved parking lot with space for 38 vehicles at the west end of Sir Francis Drake Boulevard. The Lighthouse Visitor Center is 0.5 miles to the west via a foot path, which departs from the west end of the roundabout at the northwest end of the lot. A vault toilet building and litter and recycling receptacles are located along the east side of the lot. The Point Reyes Lighthouse Visitors' Parking Lot is approximately 45 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":331,"latitude":37.99773971861882,"longitude":-123.01178992898019,"name":"Point Reyes Lighthouse Visitors' Parking Lot"},{"description":"Portage Lakefront and Riverwalk has 3 separate parking lots.","index":332,"latitude":41.630994,"longitude":-87.178383,"name":"Portage Lakefront and Riverwalk"},{"description":"Porter Beach has 2 parking lots. The North parking lot is closest to the Lake and facilities. The South parking lot is gravel.","index":333,"latitude":41.660272,"longitude":-87.069387,"name":"Porter Beach"},{"description":"This gravel parking lot for the Powell Trail is located on Cherokee County Road 275 and is the trailhead for the .75 mile (one-way) trail.","index":334,"latitude":34.193925,"longitude":85.402973,"name":"Powell Trail Parking"},{"description":"","index":335,"latitude":33.904079,"longitude":-84.442122,"name":"Powers Island Parking Lot"},{"description":"","index":336,"latitude":19.411364,"longitude":-155.249915,"name":"Pu‘upua‘i Parking Lot"},{"description":"Oversized vehicle parking at the Quarai unit.","index":337,"latitude":34.59765972652392,"longitude":-106.29819631576538,"name":"Quarai Oversized Vehicle Parking"},{"description":"This is the public parking lot at the Quarry Visitor Center in the Utah portion of the monument. This parking lot has 105 spots for vehicles plus 6 spots for large RVs or vehicles pulling trailers, 5 accessible spots and 3 spots for carpools or low emission vehicles. 5 shade structures with picnic tables are located around the parking lot. Two of these are suitable for larger groups. Trash and recycling containers are also available. Overnight parking or camping is not permitted in this parking lot.","index":338,"latitude":40.4382083333,"longitude":-109.3082972222,"name":"Quarry Visitor Center Parking Lot"},{"description":"Space for parking at the Randall Trailhead consists of approximately 1000 feet of dirt shoulder on the west side of Highway 1 (aka Shoreline Highway). There is room for up to 50 vehicles. The Randall Trailhead is on the east side of the road; the Olemy Valley Trailhead (Hagmire) is on the west side of the road. There are no other facilities or amenities at this location. This trailhead is approximately 12 minutes by car from the Bear Valley Visitor Center via Highway 1.","index":339,"latitude":37.97288270042659,"longitude":-122.73052990436554,"name":"Randall Trailhead Roadside Parking"},{"description":"Located at the junction of Highway 340 and Shenandoah Street. Intended for visitors using the river access located under the Highway 340 bridge. Parking is extremely limited. Park in designated spaces only.","index":340,"latitude":39.32169568063311,"longitude":-77.74328353538087,"name":"River Access Parking Lot"},{"description":"","index":341,"latitude":34.001875,"longitude":-84.365124,"name":"River Landing Parking Lot"},{"description":"","index":342,"latitude":34.006722,"longitude":-84.346856,"name":"Riverside Park Parking Lot"},{"description":"","index":343,"latitude":34.007382,"longitude":-84.350775,"name":"Riverside Parking Lot"},{"description":"Parking lot associated with main park contact station and numerous trailheads","index":344,"latitude":38.959404,"longitude":-77.051655,"name":"Rock Creek Park Nature Center and Planetarium"},{"description":"Dirt lot accessible by a gravel road for driving tour stop 11.","index":345,"latitude":38.80625531622434,"longitude":-77.50852265850494,"name":"Rock Road/Portici Parking Lot"},{"description":"This lot is available free of charge to all visitors to Fort Stanwix National Monument and the Rome Historical Society.","index":346,"latitude":43.21210422850979,"longitude":-75.4547667503357,"name":"Rome Historical Society"},{"description":"This is a very small pullout. It is found along the Cape Royal Road. Vehicles over 30 feet are not recommended.","index":347,"latitude":36.218,"longitude":-111.9525,"name":"Roosevelt Point Parking Lot"},{"description":"The surface of the access road is clay. During rainy weather, the road becomes dangerously slippery; it is unsafe to travel when wet. The speed limit is 25 miles per hour. Watch for livestock on the roadway.","index":348,"latitude":31.924,"longitude":-105.00619,"name":"Salt Basin Dunes Trailhead"},{"description":"Sand Beach Parking Lot serves Sand Beach, Ocean Path, and Great Head Trail. It is closed to buses, RVs, and trailers. The parking lot regularly fills during summer and you may see rangers directing vehicles at the intersection or parking lot. Follow their instructions and if parking is full or temporarily closed, be prepared to visit the site at a different time. Use the right-hand lane parking along the Park Loop Road as an alternative.","index":349,"latitude":44.330185,"longitude":-68.183989,"name":"Sand Beach Park Lot"},{"description":"Along Foxville-Deerfield Road just south of Owens Creek Campground. Provides trail access: wooden boardwalk that leads to the Sawmill Exhibit. Provides fishing access: small foot trails will lead to Owens Creek. May temporarily close due to winter weather and/or icy road conditions.","index":350,"latitude":39.658654,"longitude":-77.483701,"name":"Sawmill Exhibit Parking Area Lot"},{"description":"Parking lot with access to Schoolhouse Ridge North Trail. Access at 874 Bakerton Road, Harpers Ferry, WV 25425. Restrooms (pit toilets) are available at the trailhead. Park in designated area only.","index":351,"latitude":39.32571666615484,"longitude":-77.7668580154908,"name":"Schoolhouse Ridge North Parking Area"},{"description":"Parking area provides access to the Schoolhouse Ridge South Trail. Access at 2083 Millville Road, Harpers Ferry, WV 25425. Restrooms (pit toilets) are available at the trailhead. Park in designated area only.","index":352,"latitude":39.308572017343,"longitude":-77.78081934432637,"name":"Schoolhouse Ridge South Parking Area"},{"description":"The Scotts Bluff Summit Parking Area is reached via the Scotts Bluff Summit Road and is therefore only accessible when the Summit Road is open to vehicular traffic. It has space for 26 cars or small trucks. Two of the parking spaces are accessible.","index":353,"latitude":41.836803,"longitude":-103.700418,"name":"Scotts Bluff Summit Parking Area"},{"description":"268 acres, skate complex, outdoor basketball courts, dog park area, playground, pavilions, grill, 1.6-mile paved trail, 2.9-mile non-paved trail, restrooms, and help locator.","index":354,"latitude":34.095476,"longitude":-84.0929,"name":"Settles Bridge Park"},{"description":"","index":355,"latitude":34.09209722,"longitude":-84.09861111,"name":"Settles Bridge Parking Lot"},{"description":"The Signal Mountain Boat Launch is a paved 24-car lot with a designated handicapped parking space. Restrooms are available in the parking lot. Oversized and additional parking can be found up the road in the boat trailer lot. Wait times for spaces are low at peak.","index":356,"latitude":43.838569,"longitude":-110.615919,"name":"Signal Mountain Boat Launch Parking"},{"description":"223 acres, chapel, pavilion, grills, 3.1-mile non-paved trail, sand volleyball court, group camping, meadow, and restrooms.","index":357,"latitude":33.987122,"longitude":-84.242355,"name":"Simpsonwood Park"},{"description":"Parking lot at 139-163 Metlakatla Street, Sitka, Alaska. \"Lower lot\" is for private vehicles and has two accessible parking spaces. \"Upper lot\" has parking for both private and commercial vehicles, including large buses.","index":358,"latitude":57.04718,"longitude":-135.316,"name":"Sitka National Historical Park Parking lot"},{"description":"The Sky Trailhead Parking Lot is a dirt/gravel parking lot that can accommodate ~10 vehicles along the southwest side of Limantour Road. The Sky Trailhead is at the east corner of the lot and the Bayview Trail departs from the north corner of the lot. This is the closest trailhead to Sky Campground. There are no other facilities or amenities at this location. The Sky Trailhead Parking Lot is approximately10 minutes by car from the Bear Valley Visitor Center via Limantour Road.","index":359,"latitude":38.05487648802563,"longitude":-122.83815006985719,"name":"Sky Trailhead Parking Lot"},{"description":"A small parking lot at the end of the snake creek road at the base of 3 trailheads.","index":360,"latitude":38.92509,"longitude":-114.25122,"name":"Snake Creek Parking Lot"},{"description":"","index":361,"latitude":33.937967,"longitude":-84.443341,"name":"Sope Creek Parking Lot"},{"description":"The South Netul Parking Lot offers access to restrooms and a boat launch as well as the beginning of the Netul River Trail. There are 31 parking spaces available, including 2 ADA and 4 R.V. spaces.","index":362,"latitude":46.11755,"longitude":-123.87564,"name":"South Netul Parking Lot"},{"description":"The Split Rock Parking Area which provides access to the Split Rock Trailhead. It is a dirt parking lot with one main parking area next to the trailhead and one smaller area next to a vault toilet.","index":363,"latitude":34.009531191823555,"longitude":-116.05585492452781,"name":"Split Rock Parking Lot"},{"description":"OPEN April 1 - Oct 31 Wednesday, Friday, and Saturday CLOSED Nov 1 - Mar 31","index":364,"latitude":34.146069,"longitude":-82.006326,"name":"Star Fort Pond Parking Lot"},{"description":"A large paved parking lot with access to the river, Brecksville Station, and the Towpath Trail.","index":365,"latitude":41.317942,"longitude":-81.587465,"name":"Station Road Bridge Lot"},{"description":"Closest parking to the Stone Bridge over Bull Run Creek. Only parking lot directly on the Stone Bridge Loop Trail and one of several access points for the First Manassas Loop Trail. Driving tour stop eleven. Please park in designated spaces only.","index":366,"latitude":38.8250685275,"longitude":-77.501825509,"name":"Stone Bridge Parking Lot"},{"description":"Parking lot closest to the Stone House at the intersection of US 29, and Sudley Road. One of several access points for both the First Manassas Loop Trail and the Second Manassas Loop Trail. Driving tour stop number three. This lot is also a few minutes walk from the Henry Hill Visitor Center and is the closest available parking if the Henry Hill Lot is full. Please park in designated spaces only. No equestrian trailer parking.","index":367,"latitude":38.81930159335119,"longitude":-77.5249803888505,"name":"Stone House Parking Lot"},{"description":"A dirt small parking lot at the end of the Strawberry Creek road","index":368,"latitude":39.05568,"longitude":-114.30055,"name":"Strawberry Creek Parking Lot"},{"description":"String Lake parking lot is a paved 226-car lot with designated handicapped parking spaces. Restrooms are available in the parking lot. Buses are not allowed in the String Lake parking lot. Rangers and volunteers are generally available from June-September to provide information. Wait times for spaces are high at peak. Roadside parking is not allowed when parking lot is full. Overnight parking is only permitted for those with a backcountry permit.","index":369,"latitude":43.784981,"longitude":-110.726148,"name":"String Lake Parking Lot"},{"description":"Parking area off of Pageland Lane that services park headquarters. Access to restrooms and the Stuart Hill Loop Trail. Please do not park in park employee parking. Park in designated spaces only. No equestrian trailer parking.","index":370,"latitude":38.805249448680236,"longitude":-77.57123117201496,"name":"Stuart Hill Center Parking Area"},{"description":"Small parking lot off Sudley road near the northern park boundary. Only parking lot that offers access to the Sudley Loop trail. One of two lots that offers access to the Unfinished Railroad Trail. Driving tour stop number five. Please park in designated spaces only. No equestrian trailer access.","index":371,"latitude":38.83880453264386,"longitude":-77.5374401303042,"name":"Sudley Road Parking Lot"},{"description":"A Parking lot located on the scenic drive, this parking lot is at the base of the wheeler summit hike.","index":372,"latitude":39.01709,"longitude":-114.30369,"name":"Summit Parking Lot"},{"description":"The Sunset Beach parking lot gives access to public restrooms as well as the Fort to Sea trail which spans 6.5 miles from Fort Clatsop to Sunset Beach. This parking lot has 21 total spaces including 2 ADA spaces.","index":373,"latitude":46.09958,"longitude":-123.93697,"name":"Sunset Beach Trail head Parking"},{"description":"Filler","index":374,"latitude":37.62365,"longitude":112.1677,"name":"Sunset Point"},{"description":"The Sweetgum Picnic area and parking area reopens Friday September 30. There are 99 parking spaces in the Sweetgum Picnic Area","index":375,"latitude":38.98389,"longitude":76.89333,"name":"Sweetgum Picnic Area reopen September 30, 2022"},{"description":"Taggart Lake Trailhead parking lot is a paved 59-car lot with designated handicapped parking spaces. Parking is also allowed on the west side of the Teton Park Road, where marked. Restrooms are available in the parking lot. Wait times for spaces are high at peak.","index":376,"latitude":43.692522,"longitude":-110.732287,"name":"Taggart Lake Trailhead Parking Lot"},{"description":"Test Description","index":377,"latitude":39.034832,"longitude":-76.907474,"name":"Test Lot"},{"description":"This is the parking lot for The Wayside, on Lexington Road, Concord.","index":378,"latitude":42.45781,"longitude":-71.333119,"name":"The Wayside parking lot"},{"description":"The Windows Section is located 12 miles (19 km) from the park entrance. Park here for trails to Turret Arch, North Window, South Window, and Double Arch. Limited oversize parking is available at the lower lot near Double Arch. Toilets are open year-round. There is no drinking water available at the trailhead.","index":379,"latitude":38.68697114875784,"longitude":-109.53710317611694,"name":"The Windows Section Parking Lot"},{"description":"Located along Desert View at mile marker 248.5. This is a small unmarked pull out.","index":380,"latitude":35.99444444,"longitude":-112.02722222,"name":"Thor's Hammer Parking Lot"},{"description":"One mile north of the Visitor Center on Park Central Road. Provides trail access: Charcoal Exhibit Trail, Thurmont Vista Loop Trail, 8 mile Loop Trail, and Visitor Center-Blue Ridge Summit Vista-Hog Rock-Cunningham Falls Loop Trail. Six Picnic Tables. Map and Bulletin Board. May temporarily close due to winter weather and/or icy road conditions.","index":381,"latitude":39.647378,"longitude":-77.444017,"name":"Thurmont Vista/Charcoal Exhibit Parking Lot"},{"description":"The Tomales Bay Trailhead Parking Lot is a dirt/gravel parking lot that can accommodate ~15 vehicles. The Tomales Bay Trailhead is at the northwest corner of the lot adjacent to an interpretive exhibit. There are no other facilities or amenities at this location. The Tomales Bay Trailhead Parking Lot is approximately10 minutes by car from the Bear Valley Visitor Center via Highway 1.","index":382,"latitude":38.08715158851219,"longitude":-122.81282962132981,"name":"Tomales Bay Trailhead Parking Lot"},{"description":"A dirt parking lot at the north end of Pierce Point Road that can accommodate 20 vehicles. On busy weekends and holidays, the parking lot may be full by 10 am. If you park along the Pierce Point Road south of the parking lot, please observe all \"No Parking\" signs and ensure that no part of your parked vehicle is on the pavement in order to allow other vehicles to safely pass. The Tomales Point Parking Lot is approximately 35 minutes by car from the Bear Valley Visitor Center via Pierce Point Road.","index":383,"latitude":38.18907093806051,"longitude":-122.95403234333105,"name":"Tomales Point Parking Lot"},{"description":"The parking lot at the top of the volcano is open when Volcano Road is open from 8:30am. to 4:00pm. Labor Day to Memorial Day, and in Summer, Memorial Day to Labor Day 8:00am to 5:00pm. On busy summer weekends, it will fill up and there is a wait-list to go to the top of the volcano. You can access the Crater Vent and Crater Rim trails from this parking lot.","index":384,"latitude":36.782496,"longitude":-103.97226,"name":"Top of the Volcano Parking"},{"description":"Located at the intersection of Hwy 11 and Hayes Road, on the East boundary of the park, the Trailhead Parking Lot is open from dawn to dusk, 7 days a week.","index":385,"latitude":35.131199,"longitude":-81.797256,"name":"Trailhead Parking Lot"},{"description":"This parking area is located across the pond bridge along the Staff/Service Ent. The parking lot is not paved. Two Accessible parking spaces are located off the Staff/Service Entry Road adjacent to the Stable/Garage. The parking spaces have no access aisles; surface material is hardpacked stone dust. These two parking spaces are 280 feet from the historic core and provide an adequate accessible route into the park through the cutting garden.","index":386,"latitude":41.76292224280947,"longitude":-73.89810347886316,"name":"Trailhead Parking Lot"},{"description":"Parking lot off of Potomac Street in Lower Town. Parking is extremely limited and often fills up early. Park in designated spaces only.","index":387,"latitude":39.32443649731925,"longitude":-77.73121739894185,"name":"Train Station Parking Lot"},{"description":"","index":388,"latitude":31.5677,"longitude":-111.0513,"name":"Tumacácori Parking Lot"},{"description":"Located along Desert View Drive, the Tusayan Ruin is the remains of a small ancestral Puebloan village. It is in between Moran Point and Lipan Point. A relatively flat 0.1 mile (200 meter) trail wraps around the ruin and offers the opportunity to learn more about the place and the people who once called this home. A picnic area and restrooms are located here.","index":389,"latitude":36.01305556,"longitude":-111.86638889,"name":"Tusayan Ruin and Museum"},{"description":"Parking for Tuskegee Institute NHS is located beside The Oaks, home of Booker T. Washington. The Parking Lot is open to cars, buses, and RVs.","index":390,"latitude":32.4281626,"longitude":-85.7061182,"name":"Tuskegee Institute NHS Parking Lot"},{"description":"Two small unmarked pullouts next to each other. Located on Desert View Drive at mile marker 247.","index":391,"latitude":36.00888889,"longitude":-112.05305556,"name":"Twin Overlooks Parking Lot"},{"description":"Small gravel lot with turn around for large vehicles and trailers. Corrals next to parking lot are for official use only. This lot is the eastern access to the 3 mile (5 km) Two Section Trail into Strong City. Leashed dogs are allowed when the pasture is not occupied by cattle. Three ponds in the area permit catch and release fishing.","index":392,"latitude":38.409134,"longitude":-96.502451,"name":"Two-section"},{"description":"A tiny gravel parking lot that can accommodate three vehicles. To the west, a little-used trail leads up a small hill to the historic U.S. Life-Saving Service Cemetery. There are no other facilities or amenities at this location. The parking lot is approximately 20 minutes by car from the Bear Valley Visitor Center via Sir Francis Drake Boulevard.","index":393,"latitude":38.094325686188846,"longitude":-122.92926549911499,"name":"U.S. Life-Saving Service Cemetery Parking Lot"},{"description":"The USS Cairo Parking Lot is a an oval with accessible parking 200 feet passed the National Cemetery gates on the righthand side. Main parking spaces wrap around the left side interior oval. Oversized parking for buses, RVs, campers, ect. are located on the back end of the parking oval on the righthand side.","index":394,"latitude":32.3757496666,"longitude":-90.8671331406,"name":"USS Cairo Gunboat Museum Parking Lot"},{"description":"Lot on Featherbed Lane. One of two lots to access the Unfinished Railroad Trail and the Deep Cut Trail. One of several access point for the Second Manassas Loop Trail. Driving tour stop number four. Park in designated spaces only. No equestrian trailer parking.","index":395,"latitude":38.82561411325664,"longitude":-77.54880094029724,"name":"Unfinished Railroad Parking Lot"},{"description":"This smaller parking lot is located on the hill above the visitor contact station. It is on the same hill as the Hampton mansion giving easy access to mansion and other historic structures such the orangery, icehouse, and domestic service buildings. The lot has 23 parking spaces and is open from 8:30 am - 5:00 pm. Cars can not be left in this parking lot over night.","index":396,"latitude":39.4164,"longitude":-76.5887,"name":"Upper Parking Lot"},{"description":"This is the primary parking area at Devils Tower National Monument. From here you can access the visitor center, bookstore, restrooms and the two major trails (Tower Trail and Red Beds Trail).","index":397,"latitude":44.5,"longitude":104.7,"name":"Upper Paved Lot"},{"description":"","index":398,"latitude":19.420228,"longitude":-155.288968,"name":"Uēkahuna Parking"},{"description":"Parking lot on Vandor Lane for visitors with equestrian trailers. Non-equestrian trailered vehicles, please use the Rock Road lot. No dogs or other domestic pets. Park in designated spaces only.","index":399,"latitude":38.80657816074784,"longitude":-77.50093676714381,"name":"Vandor Lane Equestrian Parking Lot"},{"description":"Gravel parking lot off Kansas Highway 177 is open 24/7. The lot loops around to the north, allowing an easy circular traffic for campers and trailers. Handicap spaces are available near the visitor center entrance and near the barn entrance on the hill. The barn parking area closes at the end of business hours. The gravel and surrounding grass are soft after excessive rain.","index":400,"latitude":38.432285,"longitude":-96.557487,"name":"Visitor Center"},{"description":"This is the main area of the park, and is open from 9am-5:30pm. It is available for the following activities: Ferry Service to Fort Matanzas, nature trail, and fishing opportunities. Space is limited. There is NO oversized vehicle parking available.","index":401,"latitude":29.719756,"longitude":-81.234723,"name":"Visitor Center"},{"description":"Parking is available at the Visitor Center for visitors while enjoying the park. Parking is by permit which are available inside the Visitor Center when open.","index":402,"latitude":18.3327793,"longitude":-64.7937121,"name":"Visitor Center"},{"description":"A pull-off is available on the street near the park entrance for visitors with limited mobility.","index":403,"latitude":43.210462125441005,"longitude":-75.45750260353088,"name":"Visitor Center Handicapped Parking"},{"description":"This parking lot is open all day and night and is the designated Dark Sky Viewing Area. Though it is open at night, no camping is allowed in the parking lot. You can access the Nature, Lava Flow, and Boca Trails from this parking lot.","index":404,"latitude":36.77871,"longitude":-103.98001,"name":"Visitor Center Parking"},{"description":"","index":405,"latitude":39.81412,"longitude":-79.64281,"name":"Visitor Center Parking"},{"description":"Visitor Center parking is located in the parking garage accessed by Saville Ave., Quincy. Free parking validation is available in the Visitor Center during open hours. Parking garage maintained by LAZ Parking.","index":406,"latitude":42.25264106079185,"longitude":-71.00185559277077,"name":"Visitor Center Parking"},{"description":"This parking area is immediately adjacent the visitor center and is open from 8:00 a.m. and 4:00 p.m. mountain time, daily. No overnight parking is allowed. In event of winter weather conditions, this parking facility is cleared first. Severe winter storms may cause this facility to close until such time as it can be made safe.","index":407,"latitude":43.844777,"longitude":-101.90044,"name":"Visitor Center Parking Area"},{"description":"The park's main parking lot is located directly next to the visitor center. The lot has 90 parking spaces as well as six Bus/RV parking spaces. The park also has an additional overflow parking area with gravel and grass area parking. Parking is available 9am - 5pm. Parking spaces are only available to visitors to the park, cars can not be left on site if the owner leaves the park. Cars cannot be left over night.","index":408,"latitude":39.2655,"longitude":-76.5794,"name":"Visitor Center Parking Lot"},{"description":"Main parking lot for Cowpens National Battlefield; open 8:30 a.m. - 5:00 p.m.","index":409,"latitude":35.137095,"longitude":-81.818778,"name":"Visitor Center Parking Lot"},{"description":"This parking lot is located directly south of the Lincoln Home NHS visitor center. It is only accessible via 7th street, which is a one-way street running north to south. Parking lot entrance will be on the left, right after passing the visitor center. A fee is required to park in this lot. Parking can be paid for at the Visitor Center. We ask that visitors pay for parking with debit or credit card as we not accept cash. Buses, RVs, and oversized vehicles should use the bus lot north of the visitor center","index":410,"latitude":39.7967050003917,"longitude":-89.6461776005945,"name":"Visitor Center Parking Lot"},{"description":"Parking lot for visitors to the park","index":411,"latitude":37.1725,"longitude":79.98,"name":"Visitor Center Parking Lot"},{"description":"We do not have our own parking lot at the visitor center. A lot, owned by the City of Independence, is across the street from the visitor center at 223 North Main Street. As it services businesses and government offices on the historic Independence Square, the lot can be busy throughout the day. There is street parking on Main Street, but this, too, can fill up quickly. If you are in need of accessible parking advice, please call our visitor center at (816)254-9929, and we will do our best to help!","index":412,"latitude":39.09375876963824,"longitude":-94.41527917606277,"name":"Visitor Center Parking Lot"},{"description":"This is the main paved parking lot at the site. It provides accessible, bus, and regular parking for the visitor center. It is open from dawn to dusk every day. It rarely fills except on the last Saturday of April during the annual Manzanar Pilgrimage.","index":413,"latitude":36.7275084,"longitude":-118.1482243,"name":"Visitor Center Parking Lot"},{"description":"This is the parking area for the Andrew Johnson Visitor Center, the Early Home, and the Birthplace replica and Johnson statue. It is located behind the Early Home and across the street from the Visitor Center.","index":414,"latitude":36.1626,"longitude":-82.829,"name":"Visitor Center Parking Lot"},{"description":"This is the main parking lot, located at the Battlefield Visitor Center, 2332 New Garden Road, Greensboro, NC 27410. Please enter the parking lot on the left side, not the right. The entrance to the tour road is located at the backside of the parking lot. This parking lot opens at 8:30 AM and closes at 5:00 PM. Cars that are left in the lot after 5:00 PM will be subject to a fine.","index":415,"latitude":36.1316499,"longitude":-79.8471879,"name":"Visitor Center Parking Lot"},{"description":"","index":416,"latitude":44.590844,"longitude":-104.720205,"name":"Visitor Center Parking Lot"},{"description":"65 standard vehicle Parking Lot, with 6 disability parking locations","index":417,"latitude":40.208029,"longitude":-75.77322,"name":"Visitor Center Parking Lot"},{"description":"Parking lot nearest visitor center and providing access to main park attractions.","index":418,"latitude":39.2240867222,"longitude":-98.5421515,"name":"Visitor Center Parking Lot"},{"description":"All stalls available including handicaps stalls","index":419,"latitude":20.025618,"longitude":-155.821781,"name":"Visitor Center Parking Lot"},{"description":"A small lot with handicap accessible, bus and RV parking. It is a short walk to the Visitor Center from the parking lot. The parking lot is open from 9 am to 5 pm Eastern.","index":420,"latitude":38.677934,"longitude":-87.536678,"name":"Visitor Center Parking Lot"},{"description":"","index":421,"latitude":35.141202,"longitude":-81.376327,"name":"Visitor Center Parking Lot"},{"description":"The Scotts Bluff National Monument Visitor Center parking lot has space for 27 cars or small trucks. Two of these spaces are accessible. There is additional parking for 27 cars or small trucks at the adjacent picnic area. One of these spaces is accessible. There are nine parking spots for oversize vehicles at the east end of the parking lot near the picnic area.","index":422,"latitude":41.828292,"longitude":-103.707403,"name":"Visitor Center Parking Lot"},{"description":"Paved parking lot. Administration Building is on the left, and Visitor Center is on the right, with a brick patio with the shape of the Star Fort inlaid in between them. Restrooms are accessed from the ramp on the left of the brick patio.","index":423,"latitude":34.146975,"longitude":-82.023908,"name":"Visitor Center Parking Lot"},{"description":"Parking for the Harpers Ferry NHP Visitor Center and the starting point for the shuttle bus service to Lower Town. Access at 171 Shoreline Drive, Harpers Ferry, WV 25425. Can accommodate several hundred vehicles. We recommend that visitors who plan to explore museums and exhibits or are hiking a trail that begins in Lower Town utilize the main parking lot and shuttle bus. Park in designated spaces only. *NOTE: pets are not allowed on park shuttle buses or in park buildings.*","index":424,"latitude":39.3166667,"longitude":-77.75638888888889,"name":"Visitor Center Parking Lot"},{"description":"Visitor Center (GPS Address: 14707 Park Central Rd, Thurmont, MD 21788). Main parking lot: asphalt, contains 2 electric vehicle charging stations. Secondary parking lot: across Park Central Road from the Visitor Center, gravel surface. Restroom, maps, and information available at Visitor Center when open. Picnic Tables located by gravel lot. Additional parking: It is legal to park along Route 77 as long as your vehicle is entirely outside the white line. Route 77 is outside of the park jurisdiction.","index":425,"latitude":39.633864,"longitude":-77.449878,"name":"Visitor Center Parking Lots"},{"description":"Main visitor parking area, with many regular spots, multiple handicapped accessible parking spots, and special parking for buses and RVs/Campers","index":426,"latitude":37.3764,"longitude":-78.7969,"name":"Visitor Center and Historic Village"},{"description":"The Visitor Parking Lot is open daily, sunrise to sunset, year-round. The self-serve kiosk in the parking lot includes information about the park, brochures, self-guided tours, and the National Park Service Passport Stamp. Parking is limited! Carpooling is encouraged and appreciated, and groups arriving in more than two cars must call ahead to make a reservation. The Visitor Parking lot cannot accommodate RVs, buses, trailers, or other large vehicles. Please call ahead for options.","index":427,"latitude":41.256734,"longitude":-73.456066,"name":"Visitor Parking Lot"},{"description":"This is a small lot. It is found along the Cape Royal Road. Vehicles over 30 feet are not recommended.","index":428,"latitude":36.23,"longitude":-111.97388889,"name":"Vista Encantada Parking Lot"},{"description":"","index":429,"latitude":19.428724,"longitude":-155.258179,"name":"Volcano House Parking"},{"description":"On-street vehicle parking is available on W. Division Street between S. Hervey Street and S. Pine Street. Vehicles must park on the downhill side of W. Division Street (north side of the street). Large vehicle, RVs, buses and accessible parking is available on W. 2nd Street.","index":430,"latitude":33.66797,"longitude":-93.596306,"name":"W. Division Street between S. Hervey and S. Pine Streets"},{"description":"This is a long, relatively flat parking lot along the Cape Royal Road. It is a pullout. It is not recommended for vehicles over 30 feet.","index":431,"latitude":36.13244444,"longitude":-111.94166667,"name":"Walhalla Overlook Parking Lot"},{"description":"This parking lot has more spaces than the other lot at the Headquarters unit of the Morristown NHP, though it is located slightly further from the museum and the Ford Mansion. A small path through the wooded area between the lot and the museum connects the two, with another path leading around the side of the museum to the entrance.","index":432,"latitude":40.79811956296095,"longitude":-74.46725785732269,"name":"Washington's Headquarters Lower Lot"},{"description":"Access to the Valley Forge Train Station, Washington's Headquarters, the Honor Guard huts, Joseph Plumb Martin trail, Chapel trail, Mt. Joy trail, Valley Creek trail, and Horseshoe Trail.","index":433,"latitude":40.102465,"longitude":-75.45758,"name":"Washington's Headquarters Parking Lot"},{"description":"This lot is uphill and beyond the Lower Lot. It allows for easy access to both the Ford Mansion and Washington's Headquarters Museum. Most visitors seek to park here first for that reason. However, it has fewer spaces than the lower lot. An information board with park brochures is located nearby. On the way out, visitors must exit onto Morris Avenue (a one-way street) by turning left.","index":434,"latitude":40.79691344897393,"longitude":-74.46621179580688,"name":"Washington's Headquarters Upper Lot"},{"description":"A paved and accessible parking lot for the battlefield overlook and trailhead. The parking lot contains 2 ADA parking spots, 2 RV parking spots, and 11 regular parking spots.","index":435,"latitude":35.617458,"longitude":-99.700071,"name":"Washita Battlefield Overlook Parking Lot"},{"description":"A large circular parking lot with 4 ADA accessible spots, 2 large RV spots, and 36 regular spots. Inside the look is a large grassy area with a couple of trees and there are a couple of picnic tables around the parking area.","index":436,"latitude":35.617044,"longitude":-99.686491,"name":"Washita Battlefield Visitor Center Parking Lot"},{"description":"Access to the Joseph Plumb Martin trail, Wayne's Woods picnic area, Pennsylvania Columns monument, and the National Memorial Arch.","index":437,"latitude":40.088531,"longitude":-75.440466,"name":"Wayne's Woods Parking Lot"},{"description":"","index":438,"latitude":41.622934,"longitude":-87.207747,"name":"West Beach"},{"description":"This parking area access the riverside area boardwalk and beach and is ADA accessible.","index":439,"latitude":29.712319,"longitude":-81.230358,"name":"West Riverside Boardwalk"},{"description":"","index":440,"latitude":33.877757,"longitude":-84.441879,"name":"Whitewater Creek Parking Lot"},{"description":"This is the parking lot for the Widforss Trail. It it located on the Point Sublime trail, which can be found off Highway 67. This is a dirt parking lot and the Point Sublime Trail is a dirt road.","index":441,"latitude":36.22388889,"longitude":-112.065,"name":"Widforss Trailhead Parking Lot"},{"description":"","index":442,"latitude":33.994191,"longitude":-84.385654,"name":"Willeo Park Lot"},{"description":"Access to the Philander Chase Knox estate, Mt. Misery trail, Valley Creek trail, the Covered Bridge, and the Knox's Quarters area. This popular parking lot fills up early on weekends and is accessed via a bumpy dirt road not recommended for RV's, trailers, or low-clearance vehicles.","index":443,"latitude":40.083126,"longitude":-75.456734,"name":"Wilson Road Parking Lot"},{"description":"The gravel parking lot at Wolf Creek overlook is located on Alabama Highway 176 / Little River Canyon Rim Parkway and features picnic benches, a trash receptacle, and one of the best railed overlooks of Little River Canyon.","index":444,"latitude":34.215072,"longitude":85.394565,"name":"Wolf Creek Parking"},{"description":"1/2 mile north of Visitor Center on Park Central Road. Provides trail access: Visitor Center, Wolf Rock, Chimney Rock, Thurmont Vista, 8 mile Loop Trail and Visitor Center - Blue Ridge Summit Vista - Hog Rock - Cunningham Falls Loop Trail. Map and bulletin board. May temporarily close due to winter weather and/or icy road conditions. This small parking area is ideal for rock climbers.","index":445,"latitude":39.640654,"longitude":-77.445502,"name":"Wolf Rock/Chimney Rock Parking Lot"},{"description":"Wolfe Ranch is located 13 miles (21 km) from the park entrance. The three-mile roundtrip hike (4.8 km) to Delicate Arch begins here. A short walk to Wolfe Ranch and a nearby ancient rock markings panel also begins here. Limited oversize vehicle parking is available across the street from the main lot. Toilets are open year-round. There is no drinking water available at the trailhead.","index":446,"latitude":38.73508398728558,"longitude":-109.52048420906067,"name":"Wolfe Ranch Parking Lot"},{"description":"This parking lot provides access to the Wukoki Pueblo trail. It is a one way loop with 10 single vehicle spaces, 1 van accessible space, and 2 RV/Commercial bus spaces.","index":447,"latitude":35.529432257,"longitude":-111.3288402557,"name":"Wukoki Pueblo"},{"description":"This parking lot provides access to the Wupatki Visitor Center and the Wupatki Pueblo Trail. The lot is a one way loop with 40 parallel single car spaces, 2 accessible parking spaces, 7 consecutive spaces for vehicles up to 15 person capacity, and 6 consecutive spaces for larger RVs and commercial buses.","index":448,"latitude":35.520141605,"longitude":-111.3714122772,"name":"Wupatki Visitor Center"},{"description":"As you drive into the Grand Canyon Village area from the South Entrance Station, or from Desert View Drive, (Hwy 64) signs will direct you to the Yavapai Geology Museum. The Museum is located in between the Grand Canyon Visitor Center and the Grand Canyon Village along South Entrance Rd. This is a smaller lot that often fills early in the day. There are a few spaces for RVs or buses to pull through.","index":449,"latitude":36.065,"longitude":-112.11805556,"name":"Yavapai Geology Museum Parking Lot"},{"description":"Parking is available near the Yorktown Battlefield Visitor Center.","index":450,"latitude":37.22810814402446,"longitude":-76.4969145914982,"name":"Yorktown Battlefield Parking Lot"},{"description":"","index":451,"latitude":37.741321,"longitude":-119.601454,"name":"Yosemite Falls"},{"description":"","index":452,"latitude":37.74436759974996,"longitude":-119.58484018119644,"name":"Yosemite Village"},{"description":"There are about 300 parking spaces in Zion Canyon. When parking is full, the National Park Service actively manages access to Zion Canyon Scenic Drive until spaces are available.","index":453,"latitude":37.21775719005274,"longitude":-112.9740153269916,"name":"Zion Canyon Scenic Drive Parking"},{"description":"This parking lot is located next to the Zion Canyon Visitor Center near Zion's South Entrance, Watchman Campground, and South Campground. Especially from spring to late-fall when park shuttles are running, this lot often fills early in the day. If this lot is full, you can park in Springdale and ride a free shuttle to the park entrance. After you get to the entrance, you can board the Zion Canyon Shuttle to access Zion Canyon. Overnight parking is only allowed at designated campsites.","index":454,"latitude":37.19877440248674,"longitude":-112.98720049760647,"name":"Zion Canyon Visitor Center Main Parking Lot"}]
